99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_csi/esp32_mquickjs_wifi_csi.c
#include "esp32_mquickjs_wifi_frame_type.h"
#include "esp32_mquickjs_wifi_frame_filter.h"
#include "esp32_mquickjs_wifi_csi.h"
#include "esp32_mquickjs_memory.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI_CSI

#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_event_queue.h"
#include "esp32_mquickjs_future.h"
#include "esp32_mquickjs_options.h"
#include "esp32_mquickjs_reaper.h"
#include "esp32_mquickjs_wifi_csi_resources.h"
#include "esp32_mquickjs_wifi_csi_store.h"
#include "esp32_mquickjs_wifi_csi_rx_native.h"
#include "esp32_mquickjs_wifi_csi_wire.h"
#include "esp32_mquickjs_wifi_csi_batch.h"
#include "esp32_mquickjs_wifi_csi_target.h"

#if CONFIG_ESP32_MQUICKJS_WIFI_CSI_ALLOW_PROMISCUOUS
#define WIFI_CSI_PROMISCUOUS_SUPPORTED true
#else
#define WIFI_CSI_PROMISCUOUS_SUPPORTED false
#endif

#include "esp32_mquickjs_wifi_radio.h"
#include "utils/esp32_mquickjs_byte_source.h"

#include <stdatomic.h>
#include <limits.h>
#include <stdio.h>
#include <string.h>

#include "esp_heap_caps.h"
#include "esp_idf_version.h"
#include "esp_log.h"
#include "esp_system.h"
#include "esp_timer.h"
#include "esp_wifi.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

#if CONFIG_ESP32_MQUICKJS_WIFI_CSI_QUEUE_LEN > \
    CONFIG_ESP32_MQUICKJS_WIFI_CSI_POOL_CAPACITY
#error "Wi-Fi CSI queue capacity must not exceed the pool capacity"
#endif

#if CONFIG_ESP32_MQUICKJS_WIFI_CSI_MAX_BATCH_FRAMES > \
    CONFIG_ESP32_MQUICKJS_WIFI_CSI_POOL_CAPACITY
#error "Wi-Fi CSI maximum batch size must not exceed the pool capacity"
#endif

#define WIFI_CSI_EVENT_QUEUE_KEY "_eventQueue"
#define WIFI_CSI_BATCH_METADATA_BYTES ESP32_MQUICKJS_WIFI_RX_WIRE_METADATA_BYTES

typedef enum {
    WIFI_CSI_CLOSED = 0,
    WIFI_CSI_OPENING,
    WIFI_CSI_RUNNING,
    WIFI_CSI_STOPPING,
    WIFI_CSI_STOPPED,
    WIFI_CSI_FAULTED,
} wifi_csi_lifecycle_t;

typedef enum {
    WIFI_CSI_SOURCE_ASSOCIATED = 0,
    WIFI_CSI_SOURCE_PROMISCUOUS,
} wifi_csi_source_t;


typedef struct {
    wifi_csi_source_t source;
    bool fixed_channel;
    uint8_t channel;
    uint32_t pool_capacity;
    uint32_t queue_capacity;
    esp32_mquickjs_wifi_csi_capture_config_t capture;
    esp32_mquickjs_wifi_csi_packet_options_t packet;
    esp32_mquickjs_wifi_csi_filter_t filter;
} wifi_csi_options_t;

typedef struct {
    uint32_t callbacks;
    uint32_t accepted;
    uint32_t delivered_frames;
    uint32_t delivered_batches;
    uint32_t filtered_mac;
    uint32_t filtered_bssid, filtered_frame_type, filtered_frame_subtype, dropped_identity_exhausted;
    uint32_t filtered_rssi;
    uint32_t filtered_decimation;
    uint32_t filtered_rate_limit;
    uint32_t filtered_first_word_invalid;
    uint32_t filtered_channel_estimate_invalid;
    uint32_t invalid_callback_data;
    uint32_t dropped_pool_full;
    uint32_t dropped_queue_full;
    uint32_t dropped_frame_too_large;
    uint32_t dropped_closing;
    uint32_t received_bytes;
    uint32_t packet_unavailable, packet_malformed, packet_truncated;
    uint32_t dropped_packet_required, dropped_packet_incomplete, received_packet_bytes;
    uint32_t leased_frames;
} wifi_csi_stats_snapshot_t;

typedef struct {
    portMUX_TYPE lock;
    _Atomic wifi_csi_lifecycle_t lifecycle;
    uint32_t generation;
    esp32_mquickjs_runtime_t *runtime;
    esp32_mquickjs_wifi_radio_lease_t radio_lease;
    esp32_mquickjs_wifi_radio_promiscuous_lease_t promiscuous_lease;
    esp32_mquickjs_event_queue_t *event_queue;
    bool event_queue_retained;
    bool callback_registered;
    bool csi_enabled;
    bool reaper_registered;
    _Atomic bool cleanup_scheduled;
    _Atomic bool close_requested;
    _Atomic bool channel_conflicted;
    wifi_csi_options_t options;
    _Atomic(esp32_mquickjs_wifi_csi_resources_t *) resources;
    wifi_csi_stats_snapshot_t final_stats;
    uint8_t effective_channel;
    wifi_second_chan_t effective_secondary;
    uint32_t radio_generation;
    wifi_ps_type_t effective_power_save;
    esp_err_t last_error;
    const char *last_error_code;
    const char *last_error_stage;
} wifi_csi_session_t;

typedef struct {
    uint32_t generation;
} wifi_csi_session_ref_t;

typedef struct {
    uint32_t session_generation;
    uint16_t slot_index;
    uint32_t slot_generation;
    bool closed;
} wifi_csi_frame_ref_t;

typedef struct {
    uint16_t frame_count;
    bool closed;
    esp32_mquickjs_wifi_csi_event_t events[];
} wifi_csi_batch_ref_t;

typedef struct {
    esp32_mquickjs_wifi_csi_event_t event;
    bool released;
} wifi_csi_lease_ref_t;

typedef struct {
    wifi_csi_lease_ref_t lease;
    size_t offset;
    bool packet;
    bool opened;
    bool iterator_active;
    bool destroy_requested;
} wifi_csi_sample_source_t;

typedef struct {
    uint16_t frame_count;
    uint16_t payload_index;
    bool packet_pending;
    uint16_t retained_count;
    uint8_t padding_pending;
    uint32_t total_length;
    uint8_t *control;
    size_t control_length;
    bool control_emitted;
    bool opened;
    bool iterator_active;
    bool destroy_requested;
    wifi_csi_lease_ref_t leases[];
} wifi_csi_wire_source_t;
_Static_assert(ESP32_MQUICKJS_WIFI_RX_WIRE_MAX_FRAMES <=
    (SIZE_MAX - sizeof(wifi_csi_wire_source_t)) / sizeof(wifi_csi_lease_ref_t),
    "CSI wire Source allocation must fit size_t");

static const char *TAG = "esp32qjs_wifi_csi";
static wifi_csi_session_t s_wifi_csi = {.lock = portMUX_INITIALIZER_UNLOCKED};
static portMUX_TYPE s_wifi_csi_store_lock = portMUX_INITIALIZER_UNLOCKED;
static void wifi_csi_store_lock(void *opaque)
{
    (void)opaque;
    taskENTER_CRITICAL(&s_wifi_csi_store_lock);
}
static void wifi_csi_store_unlock(void *opaque)
{
    (void)opaque;
    taskEXIT_CRITICAL(&s_wifi_csi_store_lock);
}
static esp32_mquickjs_wifi_csi_store_t s_wifi_csi_store = {
    .lock = wifi_csi_store_lock, .unlock = wifi_csi_store_unlock,
    .maximum_slots = CONFIG_ESP32_MQUICKJS_WIFI_CSI_POOL_CAPACITY,
    .max_frame_bytes = CONFIG_ESP32_MQUICKJS_WIFI_CSI_MAX_FRAME_BYTES,
    .next_generation = 1,
};

static bool wifi_csi_pool_retirement_pending(void)
{
    /* Only the active control's detach suffix blocks runtime/open. Retained
     * data generations independently consume the store's bounded budget. */
    return atomic_load_explicit(&s_wifi_csi.resources, memory_order_acquire) != NULL;
}

static const char *wifi_csi_lifecycle_name(wifi_csi_lifecycle_t lifecycle)
{
    switch (lifecycle) {
        case WIFI_CSI_OPENING: return "stopped";
        case WIFI_CSI_RUNNING: return "running";
        case WIFI_CSI_STOPPING: return "stopping";
        case WIFI_CSI_STOPPED: return "stopped";
        case WIFI_CSI_FAULTED: return "faulted";
        case WIFI_CSI_CLOSED:
        default: return "closed";
    }
}

static const char *wifi_csi_source_name(wifi_csi_source_t source)
{
    return source == WIFI_CSI_SOURCE_PROMISCUOUS
        ? "promiscuous" : "associated";
}

static const char *wifi_csi_secondary_name(
    esp32_mquickjs_wifi_csi_secondary_t secondary)
{
    return secondary == ESP32_MQUICKJS_WIFI_CSI_SECONDARY_ABOVE ? "above" :
           secondary == ESP32_MQUICKJS_WIFI_CSI_SECONDARY_BELOW ? "below" :
                                                                  "none";
}

static const char *wifi_csi_wifi_secondary_name(wifi_second_chan_t secondary)
{
    return secondary == WIFI_SECOND_CHAN_ABOVE ? "above" :
           secondary == WIFI_SECOND_CHAN_BELOW ? "below" : "none";
}

static const char *wifi_csi_phy_name(esp32_mquickjs_wifi_csi_phy_t phy)
{
    switch (phy) {
        case ESP32_MQUICKJS_WIFI_CSI_PHY_LEGACY: return "legacy";
        case ESP32_MQUICKJS_WIFI_CSI_PHY_HT: return "ht";
        case ESP32_MQUICKJS_WIFI_CSI_PHY_VHT: return "vht";
        case ESP32_MQUICKJS_WIFI_CSI_PHY_HE_SU: return "he-su";
        case ESP32_MQUICKJS_WIFI_CSI_PHY_HE_MU: return "he-mu";
        case ESP32_MQUICKJS_WIFI_CSI_PHY_HE_ER_SU: return "he-er-su";
        case ESP32_MQUICKJS_WIFI_CSI_PHY_HE_TB: return "he-tb";
        case ESP32_MQUICKJS_WIFI_CSI_PHY_UNKNOWN:
        default: return "unknown";
    }
}

static void wifi_csi_format_mac(const uint8_t mac[6], char output[18])
{
    (void)snprintf(output, 18, "%02x:%02x:%02x:%02x:%02x:%02x",
                   mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
}

