99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_csi/esp32_mquickjs_wifi_csi.c
static int wifi_csi_hex_digit(char value)
{
    if (value >= '0' && value <= '9') return value - '0';
    if (value >= 'a' && value <= 'f') return value - 'a' + 10;
    if (value >= 'A' && value <= 'F') return value - 'A' + 10;
    return -1;
}

static bool wifi_csi_parse_mac_text(const char *text, uint8_t output[6])
{
    size_t index;

    if (text == NULL || strlen(text) != 17U) {
        return false;
    }
    for (index = 0; index < 6U; ++index) {
        size_t offset = index * 3U;
        int high = wifi_csi_hex_digit(text[offset]);
        int low = wifi_csi_hex_digit(text[offset + 1U]);

        if (high < 0 || low < 0 ||
            (index < 5U && text[offset + 2U] != ':')) {
            return false;
        }
        output[index] = (uint8_t)((high << 4) | low);
    }
    return true;
}

static bool wifi_csi_string_equals(JSContext *ctx, JSValue value,
                                   const char *expected)
{
    JSCStringBuf buffer;
    size_t length = 0;
    const char *text = JS_IsString(ctx, value)
        ? JS_ToCStringLen(ctx, &length, value, &buffer) : NULL;

    return text != NULL && length == strlen(expected) && memcmp(text, expected, length) == 0;
}

static bool wifi_csi_get_optional_bool(JSContext *ctx, JSValue object,
                                       const char *name, bool *value)
{
    JSValue property = JS_GetPropertyStr(ctx, object, name);

    if (JS_IsException(property)) return false;
    if (JS_IsUndefined(property)) return true;
    if (!JS_IsBool(property)) {
        JS_ThrowTypeError(ctx, "%s must be a boolean", name);
        return false;
    }
    *value = property == JS_TRUE;
    return true;
}

static void wifi_csi_default_options(wifi_csi_options_t *options)
{
    memset(options, 0, sizeof(*options));
    options->source = WIFI_CSI_SOURCE_ASSOCIATED;
    options->pool_capacity = CONFIG_ESP32_MQUICKJS_WIFI_CSI_POOL_CAPACITY;
    options->queue_capacity = CONFIG_ESP32_MQUICKJS_WIFI_CSI_QUEUE_LEN;
    options->packet.snap_length = ESP32_MQUICKJS_WIFI_CSI_DEFAULT_PACKET_BYTES;
    options->filter.sample_every = 1U;
    options->filter.valid_only = true;
    if (esp32_mquickjs_wifi_csi_target_is_he()) {
        options->capture.schema = ESP32_MQUICKJS_WIFI_CSI_SCHEMA_HE;
        options->capture.config.he.enable = true;
        options->capture.config.he.enable_legacy = true;
        options->capture.config.he.ht20 = true;
        options->capture.config.he.ht40 = true;
        options->capture.config.he.vht =
            esp32_mquickjs_wifi_csi_target_supports_vht();
        options->capture.config.he.he_su = true;
        options->capture.config.he.he_mu = true;
        options->capture.config.he.he_dcm = true;
        options->capture.config.he.he_beamformed = true;
        options->capture.config.he.he_stbc_ltf =
            ESP32_MQUICKJS_WIFI_CSI_HE_STBC_FIRST;
        options->capture.config.he.lltf_bits = 12U;
    } else {
        options->capture.schema = ESP32_MQUICKJS_WIFI_CSI_SCHEMA_LEGACY;
        options->capture.config.legacy.lltf = true;
        options->capture.config.legacy.ht_ltf = true;
        options->capture.config.legacy.stbc_ht_ltf2 = true;
        options->capture.config.legacy.ltf_merge = true;
        options->capture.config.legacy.adjacent_subcarrier_filter = true;
    }
}

static bool wifi_csi_parse_mac_values_rooted(
    JSContext *ctx, JSValue *value, const char *name,
    uint8_t output[][6], uint8_t *count)
{
    uint32_t length = 1U;
    uint32_t index;
    bool array = JS_IsArray(ctx, *value);

    if (array) {
        JSValue length_value = JS_GetPropertyStr(ctx, *value, "length");

        if (JS_IsException(length_value) ||
            JS_ToUint32(ctx, &length, length_value) != 0 ||
            length == 0U || length > ESP32_MQUICKJS_WIFI_CSI_MAX_MAC_FILTERS) {
            JS_ThrowRangeError(ctx, "%s supports 1..%u MAC addresses", name,
                               ESP32_MQUICKJS_WIFI_CSI_MAX_MAC_FILTERS);
            return false;
        }
    }
    for (index = 0; index < length; ++index) {
        JSValue entry = array
            ? JS_GetPropertyUint32(ctx, *value, index) : *value;
        JSCStringBuf buffer;
        size_t text_length = 0;
        const char *text = JS_IsString(ctx, entry)
            ? JS_ToCStringLen(ctx, &text_length, entry, &buffer) : NULL;

        if (text == NULL || text_length != 17 || !wifi_csi_parse_mac_text(text, output[index])) {
            JS_ThrowTypeError(ctx,
                "%s expects xx:xx:xx:xx:xx:xx or an array of addresses",
                name);
            return false;
        }
    }
    *count = (uint8_t)length;
    return true;
}

static bool wifi_csi_parse_mac_values(
    JSContext *ctx, JSValue value, const char *name,
    uint8_t output[][6], uint8_t *count)
{
    JSGCRef value_ref;
    JSValue *rooted_value = JS_PushGCRef(ctx, &value_ref);
    bool result;

    *rooted_value = value;
    result = wifi_csi_parse_mac_values_rooted(
        ctx, rooted_value, name, output, count);
    JS_PopGCRef(ctx, &value_ref);
    return result;
}

static const char *wifi_csi_packet_type_name(unsigned type)
{
    static const char *const names[] = {"management", "control", "data", "misc", "unknown"};
    return names[type < 5 ? type : 4];
}

static bool wifi_csi_parse_frame_filter(JSContext *ctx, JSValue value,
    bool subtypes, uint16_t *mask)
{
    JSGCRef value_ref, entry_ref;
    JSValue *root = JS_PushGCRef(ctx, &value_ref);
    JSValue *entry = JS_PushGCRef(ctx, &entry_ref);
    *root = value;
    uint32_t count;
    uint16_t result = 0;
    if (!JS_IsArray(ctx, *root)) {
        JS_ThrowTypeError(ctx, "CSI types/subtypes must be arrays");
        goto fail;
    }
    JSValue length = JS_GetPropertyStr(ctx, *root, "length");
    if (JS_IsException(length) || !esp32_mquickjs_value_to_bounded_u32(
            ctx, length, 0, subtypes ? 16 : 4, &count)) {
        if (!JS_HasException(ctx)) JS_ThrowRangeError(ctx, "Too many CSI frame types/subtypes");
        goto fail;
    }
    for (uint32_t i = 0; i < count; ++i) {
        *entry = JS_GetPropertyUint32(ctx, *root, i);
        uint32_t index = 0;
        if (JS_IsException(*entry)) goto fail;
        if (subtypes) {
            if (!esp32_mquickjs_value_to_bounded_u32(ctx, *entry, 0, 15, &index)) {
                if (!JS_HasException(ctx)) JS_ThrowRangeError(ctx, "CSI frame subtype must be 0..15");
                goto fail;
            }
        } else {
            while (index < 4 && !wifi_csi_string_equals(ctx, *entry, wifi_csi_packet_type_name(index))) ++index;
            if (JS_HasException(ctx)) goto fail;
            if (index == 4) { JS_ThrowTypeError(ctx, "Invalid CSI frame type"); goto fail; }
        }
        if (result & (1U << index)) {
            JS_ThrowTypeError(ctx, "Duplicate CSI frame type/subtype"); goto fail;
        }
        result |= 1U << index;
    }
    *mask = result;
    JS_PopGCRef(ctx, &entry_ref);
    JS_PopGCRef(ctx, &value_ref);
    return true;
fail:
    JS_PopGCRef(ctx, &entry_ref);
    JS_PopGCRef(ctx, &value_ref);
    return false;
}

