99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_csi/esp32_mquickjs_wifi_csi.c
static JSValue wifi_csi_frame_filter_to_js(JSContext *ctx, uint16_t mask, bool subtypes)
{
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewArray(ctx, 0);
    if (JS_IsException(*result)) goto fail;
    uint32_t count = 0;
    for (uint32_t i = 0; i < (subtypes ? 16U : 4U); ++i) {
        if (!(mask & (1U << i))) continue;
        JSValue value = subtypes ? JS_NewUint32(ctx, i) : JS_NewString(ctx, wifi_csi_packet_type_name(i));
        if (JS_IsException(value) || JS_IsException(JS_SetPropertyUint32(ctx, *result, count++, value))) goto fail;
    }
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref);
    return JS_EXCEPTION;
}

static bool wifi_csi_parse_filter_rooted(JSContext *ctx, JSValue *value,
                                  esp32_mquickjs_wifi_csi_filter_t *filter)
{
    static const char *const allowed[] = {
        "sourceMac", "destinationMac", "minimumRssi", "sampleEvery",
        "maximumRateHz", "validOnly", "bssid", "types", "subtypes", "frames",
    };
    JSValue property;
    int32_t signed_value;
    uint32_t unsigned_value;

    if (!esp32_mquickjs_validate_plain_options(
            ctx, *value, "wifi.csi.open({ filter })", allowed, 10U)) {
        return false;
    }
    property = JS_GetPropertyStr(ctx, *value, "sourceMac");
    if (JS_IsException(property) ||
        (!JS_IsUndefined(property) &&
         !wifi_csi_parse_mac_values(ctx, property, "filter.sourceMac",
                                    filter->source_macs,
                                    &filter->source_mac_count))) return false;
    property = JS_GetPropertyStr(ctx, *value, "destinationMac");
    if (JS_IsException(property) ||
        (!JS_IsUndefined(property) &&
         !wifi_csi_parse_mac_values(ctx, property, "filter.destinationMac",
                                    filter->destination_macs,
                                    &filter->destination_mac_count))) return false;
    property = JS_GetPropertyStr(ctx, *value, "bssid");
    if (JS_IsException(property) || (!JS_IsUndefined(property) &&
        !wifi_csi_parse_mac_values(ctx, property, "filter.bssid", filter->bssids, &filter->bssid_count))) return false;
    uint16_t mask;
    property = JS_GetPropertyStr(ctx, *value, "types");
    if (JS_IsException(property)) return false;
    if (!JS_IsUndefined(property)) {
        if (!wifi_csi_parse_frame_filter(ctx, property, false, &mask)) return false;
        filter->frame_types = (uint8_t)mask;
        filter->frame_types_set = true;
    }
    property = JS_GetPropertyStr(ctx, *value, "subtypes");
    if (JS_IsException(property)) return false;
    if (!JS_IsUndefined(property)) {
        if (!wifi_csi_parse_frame_filter(ctx, property, true, &mask)) return false;
        filter->frame_subtypes = mask;
        filter->frame_subtypes_set = true;
    }
    property = JS_GetPropertyStr(ctx, *value, "frames");
    if (JS_IsException(property)) return false;
    if (!JS_IsUndefined(property)) {
        if (!esp32_mquickjs_wifi_frame_filter_parse(ctx, property, filter->frame_subtype_masks)) return false;
        filter->frame_filter = true;
    }
    property = JS_GetPropertyStr(ctx, *value, "minimumRssi");
    if (JS_IsException(property)) return false;
    if (!JS_IsUndefined(property)) {
        if (!esp32_mquickjs_value_to_bounded_i32(
                ctx, property, -128, 127, &signed_value)) {
            return JS_ThrowRangeError(
                ctx, "filter.minimumRssi must be -128..127"), false;
        }
        filter->minimum_rssi = (int8_t)signed_value;
        filter->minimum_rssi_set = true;
    }
    property = JS_GetPropertyStr(ctx, *value, "sampleEvery");
    if (JS_IsException(property)) return false;
    if (!JS_IsUndefined(property)) {
        if (!esp32_mquickjs_value_to_bounded_u32(
                ctx, property, 1U, UINT32_MAX, &unsigned_value)) {
            return JS_ThrowRangeError(
                ctx, "filter.sampleEvery must be a positive integer"), false;
        }
        filter->sample_every = unsigned_value;
    }
    property = JS_GetPropertyStr(ctx, *value, "maximumRateHz");
    if (JS_IsException(property)) return false;
    if (!JS_IsUndefined(property)) {
        if (!esp32_mquickjs_value_to_bounded_u32(
                ctx, property, 0U, 1000000U, &unsigned_value)) {
            return JS_ThrowRangeError(
                ctx, "filter.maximumRateHz must be 0..1000000"), false;
        }
        filter->maximum_rate_hz = unsigned_value;
    }
    return wifi_csi_get_optional_bool(
        ctx, *value, "validOnly", &filter->valid_only);
}

static bool wifi_csi_parse_filter(JSContext *ctx, JSValue value,
                                  esp32_mquickjs_wifi_csi_filter_t *filter)
{
    JSGCRef value_ref;
    JSValue *rooted_value = JS_PushGCRef(ctx, &value_ref);
    bool result;

    *rooted_value = value;
    result = wifi_csi_parse_filter_rooted(ctx, rooted_value, filter);
    JS_PopGCRef(ctx, &value_ref);
    return result;
}

static bool wifi_csi_parse_legacy_capture_rooted(
    JSContext *ctx, JSValue *value,
    esp32_mquickjs_wifi_csi_capture_config_t *capture)
{
    static const char *const allowed[] = {
        "schema", "lltf", "htLtf", "stbcHtLtf2", "ltfMerge",
        "adjacentSubcarrierFilter", "scale", "dumpAck",
    };
    JSValue property;
    uint32_t shift;
    static const char *const scale_allowed[] = {"shiftBits"};

    if (!esp32_mquickjs_validate_plain_options(
            ctx, *value, "wifi.csi legacy capture", allowed, 8U)) return false;
    if (!wifi_csi_get_optional_bool(ctx, *value, "lltf",
            &capture->config.legacy.lltf) ||
        !wifi_csi_get_optional_bool(ctx, *value, "htLtf",
            &capture->config.legacy.ht_ltf) ||
        !wifi_csi_get_optional_bool(ctx, *value, "stbcHtLtf2",
            &capture->config.legacy.stbc_ht_ltf2) ||
        !wifi_csi_get_optional_bool(ctx, *value, "ltfMerge",
            &capture->config.legacy.ltf_merge) ||
        !wifi_csi_get_optional_bool(ctx, *value, "adjacentSubcarrierFilter",
            &capture->config.legacy.adjacent_subcarrier_filter) ||
        !wifi_csi_get_optional_bool(ctx, *value, "dumpAck",
            &capture->config.legacy.dump_ack)) return false;
    property = JS_GetPropertyStr(ctx, *value, "scale");
    if (JS_IsException(property)) return false;
    if (JS_IsUndefined(property) || wifi_csi_string_equals(ctx, property, "auto")) {
        capture->config.legacy.manual_scale = false;
        capture->config.legacy.shift_bits = 0U;
        return true;
    }
    if (!esp32_mquickjs_validate_plain_options(
            ctx, property, "wifi.csi legacy scale", scale_allowed, 1U)) {
        return false;
    }
    property = JS_GetPropertyStr(ctx, *value, "scale");
    if (JS_IsException(property)) return false;
    property = JS_GetPropertyStr(ctx, property, "shiftBits");
    if (JS_IsException(property) ||
        !esp32_mquickjs_value_to_bounded_u32(ctx, property, 0U, 15U, &shift)) {
        return JS_ThrowRangeError(ctx, "scale.shiftBits must be 0..15"), false;
    }
    capture->config.legacy.manual_scale = true;
    capture->config.legacy.shift_bits = (uint8_t)shift;
    return true;
}

static bool wifi_csi_parse_legacy_capture(
    JSContext *ctx, JSValue value,
    esp32_mquickjs_wifi_csi_capture_config_t *capture)
{
    JSGCRef value_ref;
    JSValue *rooted_value = JS_PushGCRef(ctx, &value_ref);
    bool result;

    *rooted_value = value;
    result = wifi_csi_parse_legacy_capture_rooted(
        ctx, rooted_value, capture);
    JS_PopGCRef(ctx, &value_ref);
    return result;
}

