99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_csi/esp32_mquickjs_wifi_csi.c
static bool wifi_csi_parse_he_capture_rooted(
    JSContext *ctx, JSValue *value,
    esp32_mquickjs_wifi_csi_capture_config_t *capture)
{
    static const char *const allowed[] = {
        "schema", "enableLegacy", "forceLegacyLtf", "ht20", "ht40",
        "vht", "heSu", "heMu", "heDcm", "heBeamformed", "heStbcLtf",
        "valueScale", "dumpAck", "lltfBits",
    };
    JSValue property;
    uint32_t number;
    size_t choice;
    static const char *const stbc_choices[] = {
        "first", "second", "alternate",
    };

    if (!esp32_mquickjs_validate_plain_options(
            ctx, *value, "wifi.csi HE capture", allowed, 14U)) return false;
    if (!wifi_csi_get_optional_bool(ctx, *value, "enableLegacy",
            &capture->config.he.enable_legacy) ||
        !wifi_csi_get_optional_bool(ctx, *value, "forceLegacyLtf",
            &capture->config.he.force_legacy_ltf) ||
        !wifi_csi_get_optional_bool(ctx, *value, "ht20",
            &capture->config.he.ht20) ||
        !wifi_csi_get_optional_bool(ctx, *value, "ht40",
            &capture->config.he.ht40) ||
        !wifi_csi_get_optional_bool(ctx, *value, "vht",
            &capture->config.he.vht) ||
        !wifi_csi_get_optional_bool(ctx, *value, "heSu",
            &capture->config.he.he_su) ||
        !wifi_csi_get_optional_bool(ctx, *value, "heMu",
            &capture->config.he.he_mu) ||
        !wifi_csi_get_optional_bool(ctx, *value, "heDcm",
            &capture->config.he.he_dcm) ||
        !wifi_csi_get_optional_bool(ctx, *value, "heBeamformed",
            &capture->config.he.he_beamformed) ||
        !wifi_csi_get_optional_bool(ctx, *value, "dumpAck",
            &capture->config.he.dump_ack)) return false;
    property = JS_GetPropertyStr(ctx, *value, "heStbcLtf");
    if (JS_IsException(property)) return false;
    if (!JS_IsUndefined(property)) {
        if (!esp32_mquickjs_value_to_enum(
                ctx, property, stbc_choices, 3U, &choice)) {
            return JS_ThrowTypeError(
                ctx, "capture.heStbcLtf expects first, second, or alternate"), false;
        }
        capture->config.he.he_stbc_ltf =
            (esp32_mquickjs_wifi_csi_he_stbc_t)choice;
    }
    property = JS_GetPropertyStr(ctx, *value, "valueScale");
    if (JS_IsException(property)) return false;
    if (!JS_IsUndefined(property)) {
        if (!esp32_mquickjs_value_to_bounded_u32(
                ctx, property, 0U, 8U, &number)) {
            return JS_ThrowRangeError(ctx, "capture.valueScale must be 0..8"), false;
        }
        capture->config.he.value_scale = (uint8_t)number;
    }
    property = JS_GetPropertyStr(ctx, *value, "lltfBits");
    if (JS_IsException(property)) return false;
    if (!JS_IsUndefined(property)) {
        if (!esp32_mquickjs_value_to_bounded_u32(
                ctx, property, 8U, 12U, &number) ||
            (number != 8U && number != 12U)) {
            return JS_ThrowRangeError(ctx, "capture.lltfBits expects 8 or 12"), false;
        }
        capture->config.he.lltf_bits = (uint8_t)number;
    }
    return true;
}

static bool wifi_csi_parse_he_capture(
    JSContext *ctx, JSValue value,
    esp32_mquickjs_wifi_csi_capture_config_t *capture)
{
    JSGCRef value_ref;
    JSValue *rooted_value = JS_PushGCRef(ctx, &value_ref);
    bool result;

    *rooted_value = value;
    result = wifi_csi_parse_he_capture_rooted(ctx, rooted_value, capture);
    JS_PopGCRef(ctx, &value_ref);
    return result;
}

static bool wifi_csi_parse_source(JSContext *ctx, JSValue value,
                                  wifi_csi_options_t *options)
{
    static const char *const allowed[] = {"mode", "channel"};
    static const char *const associated_allowed[] = {"mode"};
    JSGCRef value_ref;
    JSValue *rooted_value = JS_PushGCRef(ctx, &value_ref);
    *rooted_value = value;
    bool result = false;
    JSValue property;
    uint32_t number;
    if (!esp32_mquickjs_validate_plain_options(
            ctx, *rooted_value, "CSI source", allowed, 2U)) goto done;
    property = JS_GetPropertyStr(ctx, *rooted_value, "mode");
    if (JS_IsException(property)) goto done;
    if (wifi_csi_string_equals(ctx, property, "associated")) {
        /* No channel key at all, including channel:undefined. */
        result = esp32_mquickjs_validate_plain_options(
            ctx, *rooted_value, "associated CSI source", associated_allowed, 1U);
        if (result) options->source = WIFI_CSI_SOURCE_ASSOCIATED;
        goto done;
    }
    if (!wifi_csi_string_equals(ctx, property, "promiscuous")) {
        JS_ThrowTypeError(ctx, "source.mode expects associated or promiscuous");
        goto done;
    }
#if CONFIG_ESP32_MQUICKJS_WIFI_CSI_ALLOW_PROMISCUOUS
    options->source = WIFI_CSI_SOURCE_PROMISCUOUS;
#else
    JS_ThrowTypeError(ctx,
        "WIFI_CSI_CONFIG_UNSUPPORTED: promiscuous capture is disabled by this Build Context");
    goto done;
#endif
    property = JS_GetPropertyStr(ctx, *rooted_value, "channel");
    if (JS_IsException(property)) goto done;
    if (!JS_IsUndefined(property) &&
        !wifi_csi_string_equals(ctx, property, "current")) {
        if (!esp32_mquickjs_value_to_bounded_u32(
                ctx, property, 1U, UINT8_MAX, &number) ||
            !esp32_mquickjs_wifi_csi_target_channel_structurally_valid(
#if CONFIG_SOC_WIFI_SUPPORT_5G
                true,
#else
                false,
#endif
                (uint8_t)number)) {
            JS_ThrowRangeError(ctx, "source.channel is not structurally valid for this target");
            goto done;
        }
        options->fixed_channel = true;
        options->channel = (uint8_t)number;
    }
    result = true;
done:
    JS_PopGCRef(ctx, &value_ref);
    return result;
}

static bool wifi_csi_parse_buffering(JSContext *ctx, JSValue value,
                                     wifi_csi_options_t *options)
{
    static const char *const allowed[] = {"poolCapacity", "queueCapacity", "overflow"};
    JSGCRef value_ref;
    JSValue *rooted_value = JS_PushGCRef(ctx, &value_ref);
    *rooted_value = value;
    bool result = false;
    if (!esp32_mquickjs_validate_plain_options(
            ctx, *rooted_value, "CSI buffering", allowed, 3U)) goto done;
    JSValue property = JS_GetPropertyStr(ctx, *rooted_value, "poolCapacity");
    if (JS_IsException(property)) goto done;
    if (!JS_IsUndefined(property) &&
        !esp32_mquickjs_value_to_bounded_u32(ctx, property, 1U,
            CONFIG_ESP32_MQUICKJS_WIFI_CSI_POOL_CAPACITY, &options->pool_capacity)) {
        JS_ThrowRangeError(ctx, "buffering.poolCapacity exceeds this Build Context");
        goto done;
    }
    /* A small pool remains usable when queueCapacity is omitted. Explicit
     * queue sizes are checked, never silently clipped. */
    if (options->queue_capacity > options->pool_capacity)
        options->queue_capacity = options->pool_capacity;
    property = JS_GetPropertyStr(ctx, *rooted_value, "queueCapacity");
    if (JS_IsException(property)) goto done;
    if (!JS_IsUndefined(property) &&
        !esp32_mquickjs_value_to_bounded_u32(ctx, property, 1U,
            options->pool_capacity, &options->queue_capacity)) {
        JS_ThrowRangeError(ctx, "buffering.queueCapacity must not exceed poolCapacity");
        goto done;
    }
    property = JS_GetPropertyStr(ctx, *rooted_value, "overflow");
    if (JS_IsException(property)) goto done;
    if (!JS_IsUndefined(property) && !wifi_csi_string_equals(ctx, property, "drop-newest")) {
        JS_ThrowTypeError(ctx, "buffering.overflow only supports drop-newest");
        goto done;
    }
    result = true;
done:
    JS_PopGCRef(ctx, &value_ref);
    return result;
}

static const char *wifi_csi_packet_mode_name(esp32_mquickjs_wifi_csi_packet_mode_t mode)
{
    return mode == ESP32_MQUICKJS_WIFI_CSI_PACKET_HEADER ? "header" :
        mode == ESP32_MQUICKJS_WIFI_CSI_PACKET_FULL ? "full" : "none";
}

static bool wifi_csi_parse_packet(JSContext *ctx, JSValue value,
    esp32_mquickjs_wifi_csi_packet_options_t *options)
{
    static const char *const allowed[] = {"content", "snapLength", "required", "requireComplete"};
    JSGCRef ref;
    JSValue *root = JS_PushGCRef(ctx, &ref);
    *root = value;
    bool result = false, content_set = false;
    if (!esp32_mquickjs_validate_plain_options(ctx, *root, "CSI packet", allowed, 4)) goto done;
    JSValue property = JS_GetPropertyStr(ctx, *root, "content");
    if (JS_IsException(property)) goto done;
    if (!JS_IsUndefined(property)) {
        content_set = true;
        if (wifi_csi_string_equals(ctx, property, "none")) options->mode = ESP32_MQUICKJS_WIFI_CSI_PACKET_NONE;
        else if (wifi_csi_string_equals(ctx, property, "header")) options->mode = ESP32_MQUICKJS_WIFI_CSI_PACKET_HEADER;
        else if (wifi_csi_string_equals(ctx, property, "full")) options->mode = ESP32_MQUICKJS_WIFI_CSI_PACKET_FULL;
        else { JS_ThrowTypeError(ctx, "packet.content expects none, header or full"); goto done; }
    }
    property = JS_GetPropertyStr(ctx, *root, "snapLength");
    if (JS_IsException(property)) goto done;
    if (!JS_IsUndefined(property) && !esp32_mquickjs_value_to_bounded_u32(ctx, property,
            1, ESP32_MQUICKJS_WIFI_CSI_MAX_PACKET_BYTES, &options->snap_length)) {
        JS_ThrowRangeError(ctx, "packet.snapLength is outside the supported range"); goto done;
    }
    if (!wifi_csi_get_optional_bool(ctx, *root, "required", &options->required) ||
        !wifi_csi_get_optional_bool(ctx, *root, "requireComplete", &options->require_complete)) goto done;
    if (options->require_complete) {
        if (!content_set) options->mode = ESP32_MQUICKJS_WIFI_CSI_PACKET_FULL;
        options->required = true;
    }
    if (!esp32_mquickjs_wifi_csi_packet_options_valid(options)) {
        JS_ThrowRangeError(ctx, "CSI packet requires a complete header capacity; required needs header/full and requireComplete needs full");
        goto done;
    }
    result = true;
done:
    JS_PopGCRef(ctx, &ref);
    return result;
}

static JSValue wifi_csi_packet_options_to_js(JSContext *ctx,
    const esp32_mquickjs_wifi_csi_packet_options_t *options)
{
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx);
    bool ok = !JS_IsException(*result) &&
        esp32_mquickjs_set_property_ref(ctx, result, "content", JS_NewString(ctx, wifi_csi_packet_mode_name(options->mode))) &&
        esp32_mquickjs_set_property_ref(ctx, result, "snapLength", JS_NewUint32(ctx, options->snap_length)) &&
        esp32_mquickjs_set_property_ref(ctx, result, "required", JS_NewBool(options->required)) &&
        esp32_mquickjs_set_property_ref(ctx, result, "requireComplete", JS_NewBool(options->require_complete));
    JSValue value = JS_PopGCRef(ctx, &ref);
    return ok ? value : JS_EXCEPTION;
}

static bool wifi_csi_parse_open_options_rooted(JSContext *ctx, JSValue *value,
                                        wifi_csi_options_t *options)
{
    static const char *const allowed[] = {"source", "capture", "filter", "buffering", "packet"};
    JSValue property;
    esp32_mquickjs_wifi_csi_target_config_result_t target_result;

