99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_csi/esp32_mquickjs_wifi_csi.c
    wifi_csi_default_options(options);
    if (!esp32_mquickjs_validate_plain_options(
            ctx, *value, "wifi.csi.open(options)", allowed, 5U)) return false;
    property = JS_GetPropertyStr(ctx, *value, "source");
    if (JS_IsException(property) ||
        (!JS_IsUndefined(property) && !wifi_csi_parse_source(ctx, property, options))) return false;
    property = JS_GetPropertyStr(ctx, *value, "packet");
    if (JS_IsException(property) ||
        (!JS_IsUndefined(property) && !wifi_csi_parse_packet(ctx, property, &options->packet))) return false;
    property = JS_GetPropertyStr(ctx, *value, "filter");
    if (JS_IsException(property) ||
        (!JS_IsUndefined(property) &&
         !wifi_csi_parse_filter(ctx, property, &options->filter))) return false;
    property = JS_GetPropertyStr(ctx, *value, "buffering");
    if (JS_IsException(property) ||
        (!JS_IsUndefined(property) && !wifi_csi_parse_buffering(ctx, property, options))) return false;
    property = JS_GetPropertyStr(ctx, *value, "capture");
    if (JS_IsException(property) || JS_IsUndefined(property)) {
        return JS_ThrowTypeError(ctx, "wifi.csi.open() requires capture"), false;
    }
    JSValue schema = JS_GetPropertyStr(ctx, property, "schema");
    if (JS_IsException(schema)) return false;
    if (wifi_csi_string_equals(ctx, schema, "wifi-csi-legacy/1")) {
        options->capture.schema = ESP32_MQUICKJS_WIFI_CSI_SCHEMA_LEGACY;
        property = JS_GetPropertyStr(ctx, *value, "capture");
        if (JS_IsException(property)) return false;
        if (!wifi_csi_parse_legacy_capture(ctx, property,
                                           &options->capture)) return false;
    } else if (wifi_csi_string_equals(ctx, schema, "wifi-csi-he/1")) {
        options->capture.schema = ESP32_MQUICKJS_WIFI_CSI_SCHEMA_HE;
        property = JS_GetPropertyStr(ctx, *value, "capture");
        if (JS_IsException(property)) return false;
        if (!wifi_csi_parse_he_capture(ctx, property,
                                       &options->capture)) return false;
    } else {
        return JS_ThrowTypeError(
            ctx, "WIFI_CSI_CONFIG_SCHEMA_MISMATCH: unsupported capture schema"), false;
    }
    target_result = esp32_mquickjs_wifi_csi_target_config_validate(
        esp32_mquickjs_wifi_csi_target_is_he(),
        esp32_mquickjs_wifi_csi_target_supports_vht(),
        esp32_mquickjs_wifi_csi_target_supports_lltf_bit_mode(),
        &options->capture);
    if (target_result != ESP32_MQUICKJS_WIFI_CSI_TARGET_CONFIG_OK) {
        return JS_ThrowTypeError(
            ctx, target_result ==
                    ESP32_MQUICKJS_WIFI_CSI_TARGET_CONFIG_SCHEMA_MISMATCH
                ? "WIFI_CSI_CONFIG_SCHEMA_MISMATCH: capture schema does not match this target"
                : target_result ==
                        ESP32_MQUICKJS_WIFI_CSI_TARGET_CONFIG_UNSUPPORTED
                    ? "WIFI_CSI_CONFIG_UNSUPPORTED: capture field is not supported by this target"
                    : "WIFI_CSI_CONFIG_INVALID: invalid capture config"), false;
    }
    return true;
}

static bool wifi_csi_parse_open_options(JSContext *ctx, JSValue value,
                                        wifi_csi_options_t *options)
{
    JSGCRef value_ref;
    JSValue *rooted_value = JS_PushGCRef(ctx, &value_ref);
    bool result;

    *rooted_value = value;
    result = wifi_csi_parse_open_options_rooted(ctx, rooted_value, options);
    JS_PopGCRef(ctx, &value_ref);
    return result;
}

static void *wifi_csi_resource_calloc(size_t count, size_t size, void *opaque)
{
    (void)opaque;
    return esp32_mquickjs_memory_wireless_calloc("wifi.csi", count, size,
        ESP32_MQUICKJS_MEMORY_PINNED_INTERNAL, ESP32_MQUICKJS_MEMORY_BUDGET_POOL);
}

static void *wifi_csi_resource_malloc(size_t size, void *opaque)
{
    (void)opaque;
    return esp32_mquickjs_memory_wireless_alloc("wifi.csi", size,
        ESP32_MQUICKJS_MEMORY_PINNED_INTERNAL, ESP32_MQUICKJS_MEMORY_BUDGET_POOL);
}

static void wifi_csi_resource_free(void *ptr, void *opaque)
{
    (void)opaque;
    esp32_mquickjs_memory_payload_free(ptr);
}

static void wifi_csi_resource_retire(void *ptr, void *opaque)
{
    (void)opaque;
    (void)esp32_mquickjs_memory_wireless_retire(ptr);
}

static esp32_mquickjs_wifi_csi_allocator_t wifi_csi_resource_allocator(void)
{
    esp32_mquickjs_wifi_csi_allocator_t allocator = {
        .calloc_fn = wifi_csi_resource_calloc,
        .malloc_fn = wifi_csi_resource_malloc,
        .free_fn = wifi_csi_resource_free,
        .retire_fn = wifi_csi_resource_retire,
    };

    return allocator;
}

static void wifi_csi_snapshot_stats(wifi_csi_session_t *session)
{
    esp32_mquickjs_wifi_csi_counters_t *counters =
        &session->resources->counters;

#define WIFI_CSI_SNAPSHOT(name) \
    session->final_stats.name = atomic_load_explicit( \
        &counters->name, memory_order_acquire)
    WIFI_CSI_SNAPSHOT(callbacks);
    WIFI_CSI_SNAPSHOT(accepted);
    WIFI_CSI_SNAPSHOT(delivered_frames);
    WIFI_CSI_SNAPSHOT(delivered_batches);
    WIFI_CSI_SNAPSHOT(filtered_mac);
    WIFI_CSI_SNAPSHOT(filtered_bssid);
    WIFI_CSI_SNAPSHOT(filtered_frame_type);
    WIFI_CSI_SNAPSHOT(filtered_frame_subtype);
    WIFI_CSI_SNAPSHOT(dropped_identity_exhausted);
    WIFI_CSI_SNAPSHOT(filtered_rssi);
    WIFI_CSI_SNAPSHOT(filtered_decimation);
    WIFI_CSI_SNAPSHOT(filtered_rate_limit);
    WIFI_CSI_SNAPSHOT(filtered_first_word_invalid);
    WIFI_CSI_SNAPSHOT(filtered_channel_estimate_invalid);
    WIFI_CSI_SNAPSHOT(invalid_callback_data);
    WIFI_CSI_SNAPSHOT(dropped_pool_full);
    WIFI_CSI_SNAPSHOT(dropped_queue_full);
    WIFI_CSI_SNAPSHOT(dropped_frame_too_large);
    WIFI_CSI_SNAPSHOT(dropped_closing);
    WIFI_CSI_SNAPSHOT(received_bytes);
    WIFI_CSI_SNAPSHOT(packet_unavailable);
    WIFI_CSI_SNAPSHOT(packet_malformed);
    WIFI_CSI_SNAPSHOT(packet_truncated);
    WIFI_CSI_SNAPSHOT(dropped_packet_required);
    WIFI_CSI_SNAPSHOT(dropped_packet_incomplete);
    WIFI_CSI_SNAPSHOT(received_packet_bytes);
    WIFI_CSI_SNAPSHOT(leased_frames);
#undef WIFI_CSI_SNAPSHOT
}

