99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_csi/esp32_mquickjs_wifi_csi.c
static void wifi_csi_maybe_destroy_resources(wifi_csi_session_t *session)
{
    esp32_mquickjs_wifi_csi_resources_t *resources = NULL;
    if (session == NULL) return;
    taskENTER_CRITICAL(&session->lock);
    if (session->resources != NULL &&
        atomic_load_explicit(&session->lifecycle, memory_order_acquire) == WIFI_CSI_CLOSED) {
        wifi_csi_snapshot_stats(session);
        resources = atomic_exchange_explicit(&session->resources, NULL, memory_order_acq_rel);
    }
    taskEXIT_CRITICAL(&session->lock);
    if (resources != NULL && !esp32_mquickjs_wifi_csi_store_retire(&s_wifi_csi_store, resources)) {
        /* Unexpected native liveness remains owned and prevents reopen. */
        atomic_store_explicit(&session->resources, resources, memory_order_release);
    }
}

static esp32_mquickjs_wifi_csi_slot_t *wifi_csi_resolve_event(
    const esp32_mquickjs_wifi_csi_event_t *event)
{
    if (event == NULL) return NULL;
    esp32_mquickjs_wifi_csi_resources_t *resources =
        esp32_mquickjs_wifi_csi_store_acquire(&s_wifi_csi_store, event->session_generation);
    esp32_mquickjs_wifi_csi_slot_t *slot = esp32_mquickjs_wifi_csi_slot_from_event(resources, event);
    esp32_mquickjs_wifi_csi_store_release(&s_wifi_csi_store, resources);
    /* The caller's existing event/public/view/source owner pins this slot. */
    return slot;
}

typedef enum {
    WIFI_CSI_EVENT_RETAIN, WIFI_CSI_EVENT_RELEASE, WIFI_CSI_EVENT_CLOSE,
    WIFI_CSI_EVENT_TAKE, WIFI_CSI_EVENT_DISCARD, WIFI_CSI_EVENT_DELIVERED,
    WIFI_CSI_EVENT_BATCH_DELIVERED,
} wifi_csi_event_action_t;

static bool wifi_csi_update_event(const esp32_mquickjs_wifi_csi_event_t *event,
    wifi_csi_event_action_t action)
{
    if (event == NULL) return false;
    esp32_mquickjs_wifi_csi_resources_t *resources =
        esp32_mquickjs_wifi_csi_store_acquire(&s_wifi_csi_store, event->session_generation);
    esp32_mquickjs_wifi_csi_slot_t *slot = esp32_mquickjs_wifi_csi_slot_from_event(resources, event);
    bool result = false;
    if (slot != NULL) {
        switch (action) {
            case WIFI_CSI_EVENT_RETAIN:
                result = esp32_mquickjs_wifi_csi_slot_retain(resources, slot); break;
            case WIFI_CSI_EVENT_RELEASE:
                result = esp32_mquickjs_wifi_csi_slot_release(resources, slot); break;
            case WIFI_CSI_EVENT_CLOSE:
                result = esp32_mquickjs_wifi_csi_slot_close_public_owner(resources, slot); break;
            case WIFI_CSI_EVENT_TAKE:
                result = esp32_mquickjs_wifi_csi_slot_take_event_owner(resources, event); break;
            case WIFI_CSI_EVENT_DISCARD:
                result = esp32_mquickjs_wifi_csi_slot_discard_event(resources, event); break;
            case WIFI_CSI_EVENT_DELIVERED:
                atomic_fetch_add_explicit(&resources->counters.delivered_frames, 1U, memory_order_relaxed);
                result = true; break;
            case WIFI_CSI_EVENT_BATCH_DELIVERED:
                atomic_fetch_add_explicit(&resources->counters.delivered_batches, 1U, memory_order_relaxed);
                result = true; break;
        }
    }
    esp32_mquickjs_wifi_csi_store_release(&s_wifi_csi_store, resources);
    return result;
}

static void wifi_csi_lease_release(wifi_csi_lease_ref_t *lease)
{
    if (lease == NULL || lease->released) return;
    (void)wifi_csi_update_event(&lease->event, WIFI_CSI_EVENT_RELEASE);
    lease->released = true;
}

static void wifi_csi_lease_request_close(wifi_csi_lease_ref_t *lease)
{
    if (lease == NULL || lease->released) return;
    (void)wifi_csi_update_event(&lease->event, WIFI_CSI_EVENT_CLOSE);
    lease->released = true;
}

static wifi_csi_lease_ref_t *wifi_csi_retain_event(
    const esp32_mquickjs_wifi_csi_event_t *event)
{
    if (!wifi_csi_update_event(event, WIFI_CSI_EVENT_RETAIN)) return NULL;
    wifi_csi_lease_ref_t *lease = esp32_mquickjs_memory_wireless_calloc("wifi.csi", 1, sizeof(*lease), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (lease == NULL) {
        (void)wifi_csi_update_event(event, WIFI_CSI_EVENT_RELEASE);
        return NULL;
    }
    lease->event = *event;
    return lease;
}

static void wifi_csi_byte_view_release(void *opaque)
{
    wifi_csi_lease_ref_t *lease = opaque;

    wifi_csi_lease_release(lease);
    esp32_mquickjs_memory_payload_free(lease);
}

static bool wifi_csi_publish_event(
    const esp32_mquickjs_wifi_csi_event_t *event, void *opaque)
{
    wifi_csi_session_t *session = opaque;

    return session != NULL &&
        esp32_mquickjs_event_queue_try_send_from_callback(
            session->event_queue, event);
}

static bool wifi_csi_channel_admit(wifi_csi_session_t *session)
{
    esp32_mquickjs_wifi_radio_channel_status_t channel;
    esp_err_t err = esp32_mquickjs_wifi_radio_lease_channel_status(&session->radio_lease, &channel);
    if (channel.conflicted || atomic_load_explicit(&session->channel_conflicted, memory_order_acquire)) {
        atomic_store_explicit(&session->channel_conflicted, true, memory_order_release);
        esp32_mquickjs_wifi_csi_resources_set_accepting(session->resources, false);
        wifi_csi_lifecycle_t expected = WIFI_CSI_RUNNING;
        (void)atomic_compare_exchange_strong(&session->lifecycle, &expected, WIFI_CSI_FAULTED);
        return false;
    }
    return err == ESP_OK;
}

/* Runtime-only status refresh; callback admission uses the short Radio snapshot.
 * Retained Frame/View storage remains valid when a fixed session faults. */
static void wifi_csi_refresh_channel(wifi_csi_session_t *session)
{
    if (session->resources != NULL && atomic_load_explicit(&session->resources->identity_exhausted, memory_order_acquire)) {
        if (session->last_error == ESP_OK) {
            session->last_error = ESP_ERR_INVALID_STATE;
            session->last_error_code = "WIFI_CSI_IDENTITY_EXHAUSTED";
            session->last_error_stage = "capture-identity";
        }
        wifi_csi_lifecycle_t expected = WIFI_CSI_RUNNING;
        (void)atomic_compare_exchange_strong(&session->lifecycle, &expected, WIFI_CSI_FAULTED);
    }
    if (!session->radio_lease.acquired) return;
    uint8_t primary;
    wifi_second_chan_t secondary;
    uint32_t generation;
    (void)esp32_mquickjs_wifi_radio_get_channel(&primary, &secondary, &generation);
    esp32_mquickjs_wifi_radio_channel_status_t channel;
    if (esp32_mquickjs_wifi_radio_lease_channel_status(&session->radio_lease, &channel) == ESP_OK) {
        session->effective_channel = channel.primary;
        session->effective_secondary = channel.secondary;
        session->radio_generation = session->radio_lease.generation;
    }
    (void)wifi_csi_channel_admit(session);
    if (atomic_load_explicit(&session->channel_conflicted, memory_order_acquire) &&
        session->last_error == ESP_OK) {
        session->last_error = ESP_ERR_INVALID_STATE;
        session->last_error_code = "WIFI_CSI_CHANNEL_CONFLICT";
        session->last_error_stage = "radio-channel-change";
    }
}

static void wifi_csi_rx_callback(void *opaque, wifi_csi_info_t *info)
{
    uint64_t callback_time_us = (uint64_t)esp_timer_get_time();
    esp32_mquickjs_wifi_csi_rx_packet_t native_packet = {0};
    bool packet_available = esp32_mquickjs_wifi_csi_rx_native_take(info, &native_packet);
    wifi_csi_session_t *session = opaque;
    esp32_mquickjs_wifi_csi_metadata_t metadata;

    if (!esp32_mquickjs_wifi_csi_callback_enter(session->resources)) {
        esp32_mquickjs_wifi_csi_callback_leave(session->resources);
        return;
    }
    if (!wifi_csi_channel_admit(session)) {
        esp32_mquickjs_wifi_csi_callback_leave(session->resources);
        return;
    }
    if (info == NULL || info->buf == NULL) {
        atomic_fetch_add_explicit(
            &session->resources->counters.invalid_callback_data, 1U,
            memory_order_relaxed);
    } else {
        esp32_mquickjs_wifi_csi_target_normalize_metadata(
            info, &session->options.capture, &metadata);
        metadata.timestamp_us = callback_time_us;
        metadata.radio_generation = session->radio_lease.generation;
        /* RX may precede the default-loop home-channel notification. Do not
         * admit a packet from another primary into a strict fixed session. */
        if (session->options.fixed_channel && metadata.channel != session->options.channel) {
            atomic_store_explicit(&session->channel_conflicted, true, memory_order_release);
            (void)wifi_csi_channel_admit(session);
            esp32_mquickjs_wifi_csi_callback_leave(session->resources);
            return;
        }
        esp32_mquickjs_wifi_csi_packet_input_t packet = {
            .bytes = packet_available ? native_packet.bytes : NULL,
            .copied_length = native_packet.readable_bytes,
            .driver_packet_length = info->rx_ctrl.sig_len,
            .driver_payload_length = info->payload_len,
        };
        if (esp32_mquickjs_wifi_csi_callback_publish(
                session->resources, &metadata, (const uint8_t *)info->buf,
                info->len, &packet, wifi_csi_publish_event, session) ==
                ESP32_MQUICKJS_WIFI_CSI_PUBLISH_IDENTITY_EXHAUSTED) {
            wifi_csi_lifecycle_t expected = WIFI_CSI_RUNNING;
            (void)atomic_compare_exchange_strong(&session->lifecycle, &expected, WIFI_CSI_FAULTED);
        }
    }
    esp32_mquickjs_wifi_csi_callback_leave(session->resources);
}

static void wifi_csi_event_drop(void *event, void *opaque)
{
    (void)opaque;
    (void)wifi_csi_update_event(event, WIFI_CSI_EVENT_DISCARD);
}

static void wifi_csi_request_reap(wifi_csi_session_t *session);

