99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_csi/esp32_mquickjs_wifi_csi.c
static void wifi_csi_event_queue_close(void *opaque)
{
    wifi_csi_session_t *session = &s_wifi_csi;

    if ((uint32_t)(uintptr_t)opaque == session->generation && atomic_load_explicit(
            &session->lifecycle, memory_order_acquire) != WIFI_CSI_CLOSED) {
        wifi_csi_request_reap(session);
    }
}

static JSValue wifi_csi_throw_driver_error(JSContext *ctx,
                                            const char *code,
                                            const char *stage,
                                            esp_err_t err)
{
    JSGCRef details_ref;
    JSValue *details = JS_PushGCRef(ctx, &details_ref);
    JSValue result;

    s_wifi_csi.last_error = err;
    s_wifi_csi.last_error_code = code;
    s_wifi_csi.last_error_stage = stage;
    *details = JS_NewObject(ctx);
    if (JS_IsException(*details) ||
        !esp32_mquickjs_set_property_ref(
            ctx, details, "stage", JS_NewString(ctx, stage)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, details, "espCode", JS_NewInt32(ctx, err)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, details, "espName", JS_NewString(ctx, esp_err_to_name(err))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, details, "radioGeneration",
            JS_NewUint32(ctx, s_wifi_csi.radio_generation)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, details, "configSchema",
            JS_NewString(ctx,
                esp32_mquickjs_wifi_csi_target_schema_name()))) {
        JS_PopGCRef(ctx, &details_ref);
        return JS_EXCEPTION;
    }
    result = esp32_mquickjs_throw_native_error(
        ctx, code, "wifi.csi", "Wi-Fi CSI operation failed", *details);
    JS_PopGCRef(ctx, &details_ref);
    return result;
}

static esp_err_t wifi_csi_start_native(wifi_csi_session_t *session)
{
    esp32_mquickjs_wifi_radio_status_t radio_status;
    esp_err_t err;

    if (session == NULL || !session->radio_lease.acquired) {
        return ESP_ERR_INVALID_STATE;
    }
    err = esp32_mquickjs_wifi_radio_ensure_started(&session->radio_lease);
    if (err != ESP_OK) {
        session->last_error_stage = "wifi_radio_ensure_started";
        return err;
    }
    err = esp32_mquickjs_wifi_radio_get_status(&radio_status);
    if (err != ESP_OK) {
        session->last_error_stage = "wifi_radio_get_status";
        return err;
    }
    session->effective_power_save = radio_status.power_save_available
        ? radio_status.power_save : WIFI_PS_NONE;
    if (session->options.fixed_channel) {
        err = esp32_mquickjs_wifi_radio_set_channel(
            &session->radio_lease, session->options.channel,
            WIFI_SECOND_CHAN_NONE);
        if (err != ESP_OK) {
            session->last_error_stage = "wifi_radio_set_channel";
            return err;
        }
    }
    if (session->options.source == WIFI_CSI_SOURCE_PROMISCUOUS) {
        err = esp32_mquickjs_wifi_radio_acquire_promiscuous(
            &session->radio_lease, &session->promiscuous_lease);
        if (err != ESP_OK) {
            session->last_error_stage = "wifi_radio_acquire_promiscuous";
            if (!session->promiscuous_lease.acquired)
                esp32_mquickjs_wifi_radio_release_channel(&session->radio_lease);
            return err;
        }
    }
    uint32_t channel_generation;
    err = esp32_mquickjs_wifi_radio_get_channel(
        &session->effective_channel, &session->effective_secondary,
        &channel_generation);
    if (err != ESP_OK) {
        session->last_error_stage = "wifi_radio_get_channel";
        goto fail_radio_policy;
    }
    session->radio_generation = session->radio_lease.generation;
    atomic_store_explicit(&session->channel_conflicted, false, memory_order_release);
    err = esp_wifi_set_csi_rx_cb(wifi_csi_rx_callback, session);
    if (err != ESP_OK) {
        session->last_error_stage = "esp_wifi_set_csi_rx_cb";
        goto fail_radio_policy;
    }
    session->callback_registered = true;
    err = esp32_mquickjs_wifi_csi_target_apply_config(
        &session->options.capture);
    if (err != ESP_OK) {
        session->last_error_stage = "esp_wifi_set_csi_config";
        goto fail_callback;
    }
    esp32_mquickjs_wifi_csi_rx_native_enable(true); /* Header facts/filters also apply to packet.content=none. */
    esp32_mquickjs_wifi_csi_resources_set_accepting(
        session->resources, true);
    err = esp_wifi_set_csi(true);
    if (err != ESP_OK) {
        session->last_error_stage = "esp_wifi_set_csi";
        esp32_mquickjs_wifi_csi_resources_set_accepting(
            session->resources, false);
        goto fail_callback;
    }
    session->csi_enabled = true;
    session->last_error = ESP_OK;
    session->last_error_code = NULL;
    session->last_error_stage = NULL;
    atomic_store_explicit(&session->lifecycle, WIFI_CSI_RUNNING,
                          memory_order_release);
    return ESP_OK;

fail_callback:
    esp32_mquickjs_wifi_csi_rx_native_enable(false);
    if (esp_wifi_set_csi_rx_cb(NULL, NULL) == ESP_OK) {
        session->callback_registered = false;
    }
fail_radio_policy:
    if (!session->callback_registered) {
        esp32_mquickjs_wifi_radio_release_promiscuous(
            &session->promiscuous_lease);
        if (!session->promiscuous_lease.acquired)
            esp32_mquickjs_wifi_radio_release_channel(&session->radio_lease);
    }
    return err;
}

static const char *wifi_csi_start_error_code(
    const wifi_csi_session_t *session, esp_err_t err)
{
    const char *stage = session != NULL && session->last_error_stage != NULL
        ? session->last_error_stage : "";

    if (session != NULL &&
        session->options.source == WIFI_CSI_SOURCE_PROMISCUOUS &&
        strcmp(stage, "wifi_radio_acquire_promiscuous") == 0) {
        return "WIFI_CSI_PROMISCUOUS_CONFLICT";
    }
    if (session != NULL && session->options.fixed_channel &&
        strcmp(stage, "wifi_radio_set_channel") == 0) {
        return err == ESP_ERR_NOT_ALLOWED || err == ESP_ERR_INVALID_ARG
            ? "WIFI_CSI_REGULATORY_CONFLICT"
            : "WIFI_CSI_RADIO_CONFLICT";
    }
    return "WIFI_CSI_DRIVER_ERROR";
}

static void wifi_csi_radio_cleanup_failed(wifi_csi_session_t *session, const char *stage)
{
    esp32_mquickjs_wifi_radio_status_t status;
    session->last_error = ESP_ERR_INVALID_STATE;
    session->last_error_stage = stage;
    if (esp32_mquickjs_wifi_radio_get_status(&status) == ESP_OK && status.cleanup_error != ESP_OK) {
        session->last_error = status.cleanup_error;
        if (status.cleanup_stage != NULL) session->last_error_stage = status.cleanup_stage;
    }
    atomic_store_explicit(&session->lifecycle, WIFI_CSI_FAULTED, memory_order_release);
}

