99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_csi/esp32_mquickjs_wifi_csi.c
static void wifi_csi_finish_stop(wifi_csi_session_t *session)
{
    if (session == NULL ||
        atomic_load_explicit(&session->resources->callbacks_active,
                             memory_order_acquire) != 0U ||
        session->csi_enabled || session->callback_registered) return;
    if (session->event_queue != NULL) {
        (void)esp32_mquickjs_event_queue_discard_all(session->event_queue);
    }
    esp32_mquickjs_wifi_radio_release_promiscuous(
        &session->promiscuous_lease);
    if (session->promiscuous_lease.acquired) {
        wifi_csi_radio_cleanup_failed(session, "wifi_radio_release_promiscuous");
        return;
    }
    esp32_mquickjs_wifi_radio_release_channel(&session->radio_lease);
    atomic_store_explicit(&session->lifecycle, WIFI_CSI_STOPPED,
                          memory_order_release);
}

static void wifi_csi_finish_close(wifi_csi_session_t *session)
{
    esp32_mquickjs_event_queue_t *queue;

    if (session == NULL || session->csi_enabled || session->promiscuous_lease.acquired ||
        atomic_load_explicit(&session->lifecycle, memory_order_acquire) != WIFI_CSI_STOPPED ||
        session->callback_registered ||
        atomic_load_explicit(&session->resources->callbacks_active,
                             memory_order_acquire) != 0U) return;
    esp32_mquickjs_wifi_radio_release(&session->radio_lease);
    if (session->radio_lease.acquired) {
        wifi_csi_radio_cleanup_failed(session, "wifi_radio_release");
        return;
    }
    queue = session->event_queue;
    session->event_queue = NULL;
    atomic_store_explicit(&session->lifecycle, WIFI_CSI_CLOSED,
                          memory_order_release);
    if (queue != NULL) {
        (void)esp32_mquickjs_event_queue_close(queue);
        (void)esp32_mquickjs_event_queue_discard_all(queue);
    }
    if (session->event_queue_retained && queue != NULL) {
        session->event_queue_retained = false;
        esp32_mquickjs_event_queue_release(queue);
    }
    wifi_csi_maybe_destroy_resources(session);
}

static void wifi_csi_cleanup_worker(void *opaque)
{
    wifi_csi_session_t *session = opaque;
    esp32_mquickjs_runtime_t *runtime;

    if (session == NULL) return;
    runtime = session->runtime;
    while (atomic_load_explicit(&session->resources->callbacks_active,
                                memory_order_acquire) != 0U) {
        vTaskDelay(1);
    }
    wifi_csi_finish_stop(session);
    if (atomic_load_explicit(&session->close_requested,
                             memory_order_acquire)) {
        wifi_csi_finish_close(session);
    }
    if (runtime != NULL) {
        esp32_mquickjs_notify_activity(runtime);
    }
    atomic_store_explicit(&session->cleanup_scheduled, false,
                          memory_order_release);
}

static bool wifi_csi_schedule_cleanup(wifi_csi_session_t *session)
{
    bool expected = false;

    if (session == NULL || !atomic_compare_exchange_strong_explicit(
            &session->cleanup_scheduled, &expected, true,
            memory_order_acq_rel, memory_order_acquire)) {
        return session != NULL && expected;
    }
    if (esp32_mquickjs_submit_background_worker(
            wifi_csi_cleanup_worker, session)) return true;
    atomic_store_explicit(&session->cleanup_scheduled, false,
                          memory_order_release);
    return false;
}

static esp_err_t wifi_csi_begin_stop(wifi_csi_session_t *session)
{
    wifi_csi_lifecycle_t lifecycle;
    esp_err_t result = ESP_OK;
    esp_err_t err;

    if (session == NULL) return ESP_ERR_INVALID_ARG;
    lifecycle = atomic_load_explicit(&session->lifecycle,
                                     memory_order_acquire);
    if (lifecycle == WIFI_CSI_CLOSED ||
        (lifecycle == WIFI_CSI_STOPPED && !session->promiscuous_lease.acquired &&
         !session->csi_enabled && !session->callback_registered) ||
        lifecycle == WIFI_CSI_STOPPING) return ESP_OK;
    atomic_store_explicit(&session->lifecycle, WIFI_CSI_STOPPING,
                          memory_order_release);
    esp32_mquickjs_wifi_csi_resources_set_accepting(
        session->resources, false);
    esp32_mquickjs_wifi_csi_rx_native_enable(false);
    if (session->csi_enabled) {
        err = esp_wifi_set_csi(false);
        if (err == ESP_OK) {
            session->csi_enabled = false;
        } else if (result == ESP_OK) {
            result = err;
            session->last_error_stage = "esp_wifi_set_csi(false)";
        }
    }
    if (session->callback_registered) {
        err = esp_wifi_set_csi_rx_cb(NULL, NULL);
        if (err == ESP_OK) {
            session->callback_registered = false;
        } else if (result == ESP_OK) {
            result = err;
            session->last_error_stage = "esp_wifi_set_csi_rx_cb(NULL)";
        }
    }
    if (result != ESP_OK) {
        session->last_error = result;
        atomic_store_explicit(&session->lifecycle, WIFI_CSI_FAULTED,
                              memory_order_release);
    }
    return result;
}

static bool wifi_csi_poll_stop(wifi_csi_session_t *session)
{
    if (session == NULL) return false;
    if (atomic_load_explicit(&session->lifecycle, memory_order_acquire) !=
            WIFI_CSI_STOPPING) return true;
    if (atomic_load_explicit(&session->resources->callbacks_active,
                             memory_order_acquire) == 0U) {
        wifi_csi_finish_stop(session);
        if (atomic_load_explicit(&session->close_requested,
                                 memory_order_acquire)) {
            wifi_csi_finish_close(session);
        }
        return true;
    }
    (void)wifi_csi_schedule_cleanup(session);
    return false;
}

static esp_err_t wifi_csi_stop_native(wifi_csi_session_t *session)
{
    esp_err_t err = wifi_csi_begin_stop(session);

    if (err != ESP_OK) return err;
    while (!wifi_csi_poll_stop(session) ||
           atomic_load_explicit(&session->cleanup_scheduled,
                                memory_order_acquire)) {
        if (session->runtime == NULL ||
            !esp32_mquickjs_cooperative_delay(session->runtime, 1U)) {
            vTaskDelay(1);
        }
    }
    return atomic_load_explicit(&session->lifecycle, memory_order_acquire) ==
                WIFI_CSI_FAULTED
        ? session->last_error : ESP_OK;
}

static bool wifi_csi_close_native(wifi_csi_session_t *session)
{
    esp_err_t err;

    if (session == NULL) return true;
    if (atomic_load_explicit(&session->lifecycle, memory_order_acquire) ==
            WIFI_CSI_CLOSED &&
        !atomic_load_explicit(&session->cleanup_scheduled,
                              memory_order_acquire)) return true;
    atomic_store_explicit(&session->close_requested, true,
                          memory_order_release);
    err = wifi_csi_stop_native(session);
    if (err != ESP_OK) return false;
    if (atomic_load_explicit(&session->lifecycle, memory_order_acquire) !=
            WIFI_CSI_CLOSED) {
        wifi_csi_finish_close(session);
    }
    return atomic_load_explicit(&session->lifecycle, memory_order_acquire) ==
        WIFI_CSI_CLOSED;
}

