99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_csi/esp32_mquickjs_wifi_csi.c
static bool wifi_csi_reap(void *opaque)
{
    wifi_csi_session_t *session = &s_wifi_csi;
    if ((uint32_t)(uintptr_t)opaque != session->generation) return true;
    wifi_csi_lifecycle_t lifecycle;

    if (session == NULL) return true;
    atomic_store_explicit(&session->close_requested, true,
                          memory_order_release);
    if (wifi_csi_begin_stop(session) != ESP_OK) return false;
    (void)wifi_csi_poll_stop(session);
    lifecycle = atomic_load_explicit(&session->lifecycle,
                                     memory_order_acquire);
    if (lifecycle == WIFI_CSI_STOPPED &&
        !atomic_load_explicit(&session->cleanup_scheduled,
                              memory_order_acquire)) {
        wifi_csi_finish_close(session);
        lifecycle = atomic_load_explicit(&session->lifecycle,
                                         memory_order_acquire);
    }
    if (lifecycle == WIFI_CSI_CLOSED &&
        !atomic_load_explicit(&session->cleanup_scheduled,
                              memory_order_acquire)) {
        session->reaper_registered = false;
        return true;
    }
    return false;
}

static void wifi_csi_request_reap(wifi_csi_session_t *session)
{
    if (session == NULL || session->runtime == NULL ||
        atomic_load_explicit(&session->lifecycle,
                             memory_order_acquire) == WIFI_CSI_CLOSED) return;
    if (!session->reaper_registered) {
        session->reaper_registered = esp32_mquickjs_register_reaper(
            session->runtime, wifi_csi_reap, (void *)(uintptr_t)session->generation);
        if (!session->reaper_registered) {
            ESP_LOGE(TAG, "Wi-Fi CSI cleanup registry is full");
        }
    }
    esp32_mquickjs_notify_activity(session->runtime);
}

static JSValue wifi_csi_string_array(JSContext *ctx,
                                     const char *const *values,
                                     size_t count)
{
    JSGCRef array_ref;
    JSGCRef item_ref;
    JSValue *array = JS_PushGCRef(ctx, &array_ref);
    JSValue *item = JS_PushGCRef(ctx, &item_ref);
    size_t index;

    *array = JS_NewArray(ctx, 0);
    *item = JS_UNDEFINED;
    if (JS_IsException(*array)) {
        JS_PopGCRef(ctx, &item_ref);
        JS_PopGCRef(ctx, &array_ref);
        return JS_EXCEPTION;
    }
    for (index = 0; index < count; ++index) {
        *item = JS_NewString(ctx, values[index]);
        if (JS_IsException(*item) ||
            JS_IsException(JS_SetPropertyUint32(
                ctx, *array, (uint32_t)index, *item))) {
            JS_PopGCRef(ctx, &item_ref);
            JS_PopGCRef(ctx, &array_ref);
            return JS_EXCEPTION;
        }
        *item = JS_UNDEFINED;
    }
    JS_PopGCRef(ctx, &item_ref);
    return JS_PopGCRef(ctx, &array_ref);
}

static JSValue wifi_csi_24ghz_channels_to_js(
    JSContext *ctx, const wifi_country_t *country)
{
    JSGCRef array_ref, item_ref;
    JSValue *array = JS_PushGCRef(ctx, &array_ref);
    JSValue *item = JS_PushGCRef(ctx, &item_ref);
    uint16_t channel;
    uint16_t end;
    uint32_t index = 0U;

    *array = JS_NewArray(ctx, 0);
    *item = JS_UNDEFINED;
    if (JS_IsException(*array)) goto fail;
    end = (uint16_t)country->schan + country->nchan;
    for (channel = country->schan; channel < end && channel <= 14U;
         ++channel) {
        *item = JS_NewUint32(ctx, channel);
        if (JS_IsException(*item) ||
            JS_IsException(JS_SetPropertyUint32(ctx, *array, index++, *item)))
            goto fail;
        *item = JS_UNDEFINED;
    }
    JS_PopGCRef(ctx, &item_ref);
    return JS_PopGCRef(ctx, &array_ref);

fail:
    JS_PopGCRef(ctx, &item_ref);
    JS_PopGCRef(ctx, &array_ref);
    return JS_EXCEPTION;
}

#if CONFIG_SOC_WIFI_SUPPORT_5G
static JSValue wifi_csi_5ghz_channels_to_js(
    JSContext *ctx, uint32_t channel_mask)
{
    static const uint8_t channels[] = {
        36U, 40U, 44U, 48U, 52U, 56U, 60U, 64U,
        100U, 104U, 108U, 112U, 116U, 120U, 124U, 128U,
        132U, 136U, 140U, 144U, 149U, 153U, 157U, 161U,
        165U, 169U, 173U, 177U,
    };
    JSGCRef array_ref, item_ref;
    JSValue *array = JS_PushGCRef(ctx, &array_ref);
    JSValue *item = JS_PushGCRef(ctx, &item_ref);
    uint32_t input_index;
    uint32_t output_index = 0U;

    *array = JS_NewArray(ctx, 0);
    *item = JS_UNDEFINED;
    if (JS_IsException(*array)) goto fail;
    for (input_index = 0U; input_index < sizeof(channels); ++input_index) {
        if ((channel_mask & (1UL << (input_index + 1U))) == 0U) continue;
        *item = JS_NewUint32(ctx, channels[input_index]);
        if (JS_IsException(*item) ||
            JS_IsException(JS_SetPropertyUint32(
                ctx, *array, output_index++, *item))) goto fail;
        *item = JS_UNDEFINED;
    }
    JS_PopGCRef(ctx, &item_ref);
    return JS_PopGCRef(ctx, &array_ref);

fail:
    JS_PopGCRef(ctx, &item_ref);
    JS_PopGCRef(ctx, &array_ref);
    return JS_EXCEPTION;
}
#endif

static JSValue wifi_csi_radio_capabilities_to_js(JSContext *ctx)
{
    JSGCRef result_ref, bands_ref, band_ref, allowed_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *bands = JS_PushGCRef(ctx, &bands_ref);
    JSValue *band = JS_PushGCRef(ctx, &band_ref);
    JSValue *allowed = JS_PushGCRef(ctx, &allowed_ref);
    wifi_country_t country = {0};
    bool country_available = esp_wifi_get_country(&country) == ESP_OK;
    char country_code[4] = {0};
    const char *policy = NULL;
    uint32_t band_index = 0U;

    *result = JS_NewObject(ctx);
    *bands = JS_NewArray(ctx, 0);
    *band = JS_UNDEFINED;
    *allowed = JS_UNDEFINED;
    if (JS_IsException(*result) || JS_IsException(*bands)) goto fail;
    if (country_available) {
        memcpy(country_code, country.cc, sizeof(country.cc));
        if (country.policy == WIFI_COUNTRY_POLICY_AUTO) policy = "auto";
        if (country.policy == WIFI_COUNTRY_POLICY_MANUAL) policy = "manual";
    }
    *band = JS_NewObject(ctx);
    *allowed = country_available
        ? wifi_csi_24ghz_channels_to_js(ctx, &country) : JS_NULL;
    if (JS_IsException(*band) || JS_IsException(*allowed) ||
        !esp32_mquickjs_set_property_ref(
            ctx, band, "band", JS_NewString(ctx, "2.4GHz")) ||
        !esp32_mquickjs_set_property_ref(
            ctx, band, "allowedChannels", *allowed) ||
        JS_IsException(JS_SetPropertyUint32(
            ctx, *bands, band_index++, *band))) goto fail;
    *allowed = JS_UNDEFINED;
    *band = JS_UNDEFINED;
#if CONFIG_SOC_WIFI_SUPPORT_5G
    *band = JS_NewObject(ctx);
    *allowed = country_available &&
            country.policy == WIFI_COUNTRY_POLICY_MANUAL &&
            country.wifi_5g_channel_mask != 0U
        ? wifi_csi_5ghz_channels_to_js(
            ctx, country.wifi_5g_channel_mask) : JS_NULL;
    if (JS_IsException(*band) || JS_IsException(*allowed) ||
        !esp32_mquickjs_set_property_ref(
            ctx, band, "band", JS_NewString(ctx, "5GHz")) ||
        !esp32_mquickjs_set_property_ref(
            ctx, band, "allowedChannels", *allowed) ||
        JS_IsException(JS_SetPropertyUint32(
            ctx, *bands, band_index++, *band))) goto fail;
    *allowed = JS_UNDEFINED;
    *band = JS_UNDEFINED;
#endif
    if (!esp32_mquickjs_set_property_ref(
            ctx, result, "country", country_available
                ? JS_NewString(ctx, country_code) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "policy", policy != NULL
                ? JS_NewString(ctx, policy) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "bands", *bands))
        goto fail;
    *bands = JS_UNDEFINED;
    JS_PopGCRef(ctx, &allowed_ref);
    JS_PopGCRef(ctx, &band_ref);
    JS_PopGCRef(ctx, &bands_ref);
    return JS_PopGCRef(ctx, &result_ref);

