99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_csi/esp32_mquickjs_wifi_csi.c
fail:
    JS_PopGCRef(ctx, &allowed_ref);
    JS_PopGCRef(ctx, &band_ref);
    JS_PopGCRef(ctx, &bands_ref);
    JS_PopGCRef(ctx, &result_ref);
    return JS_EXCEPTION;
}

static JSValue wifi_csi_mac_array(JSContext *ctx,
                                  const uint8_t values[][6],
                                  uint8_t count)
{
    JSGCRef array_ref;
    JSGCRef item_ref;
    JSValue *array = JS_PushGCRef(ctx, &array_ref);
    JSValue *item = JS_PushGCRef(ctx, &item_ref);
    uint8_t index;

    *array = JS_NewArray(ctx, 0);
    *item = JS_UNDEFINED;
    if (JS_IsException(*array)) {
        JS_PopGCRef(ctx, &item_ref);
        JS_PopGCRef(ctx, &array_ref);
        return JS_EXCEPTION;
    }
    for (index = 0; index < count; ++index) {
        char text[18];

        wifi_csi_format_mac(values[index], text);
        *item = JS_NewString(ctx, text);
        if (JS_IsException(*item) ||
            JS_IsException(JS_SetPropertyUint32(
                ctx, *array, index, *item))) {
            JS_PopGCRef(ctx, &item_ref);
            JS_PopGCRef(ctx, &array_ref);
            return JS_EXCEPTION;
        }
        *item = JS_UNDEFINED;
    }
    JS_PopGCRef(ctx, &item_ref);
    return JS_PopGCRef(ctx, &array_ref);
}

static JSValue wifi_csi_capture_to_js(JSContext *ctx,
                                      const wifi_csi_options_t *options)
{
    JSGCRef object_ref;
    JSGCRef scale_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *scale = JS_PushGCRef(ctx, &scale_ref);
    bool ok;

    *object = JS_NewObject(ctx);
    *scale = JS_UNDEFINED;
    if (JS_IsException(*object)) goto fail;
    if (options->capture.schema == ESP32_MQUICKJS_WIFI_CSI_SCHEMA_LEGACY) {
        const esp32_mquickjs_wifi_csi_legacy_config_t *config =
            &options->capture.config.legacy;

        if (config->manual_scale) {
            *scale = JS_NewObject(ctx);
            if (JS_IsException(*scale) ||
                !esp32_mquickjs_set_property_ref(
                    ctx, scale, "shiftBits",
                    JS_NewUint32(ctx, config->shift_bits))) goto fail;
        } else {
            *scale = JS_NewString(ctx, "auto");
        }
        ok = esp32_mquickjs_set_property_ref(
                 ctx, object, "schema",
                 JS_NewString(ctx, "wifi-csi-legacy/1")) &&
             esp32_mquickjs_set_property_ref(
                 ctx, object, "lltf", JS_NewBool(config->lltf)) &&
             esp32_mquickjs_set_property_ref(
                 ctx, object, "htLtf", JS_NewBool(config->ht_ltf)) &&
             esp32_mquickjs_set_property_ref(
                 ctx, object, "stbcHtLtf2",
                 JS_NewBool(config->stbc_ht_ltf2)) &&
             esp32_mquickjs_set_property_ref(
                 ctx, object, "ltfMerge", JS_NewBool(config->ltf_merge)) &&
             esp32_mquickjs_set_property_ref(
                 ctx, object, "adjacentSubcarrierFilter",
                 JS_NewBool(config->adjacent_subcarrier_filter)) &&
             esp32_mquickjs_set_property_ref(ctx, object, "scale", *scale) &&
             esp32_mquickjs_set_property_ref(
                 ctx, object, "dumpAck", JS_NewBool(config->dump_ack));
        *scale = JS_UNDEFINED;
    } else {
        const esp32_mquickjs_wifi_csi_he_config_t *config =
            &options->capture.config.he;
        const char *stbc = config->he_stbc_ltf ==
                ESP32_MQUICKJS_WIFI_CSI_HE_STBC_SECOND
            ? "second" : config->he_stbc_ltf ==
                    ESP32_MQUICKJS_WIFI_CSI_HE_STBC_ALTERNATE
                ? "alternate" : "first";

        ok = esp32_mquickjs_set_property_ref(
                 ctx, object, "schema",
                 JS_NewString(ctx, "wifi-csi-he/1")) &&
             esp32_mquickjs_set_property_ref(
                 ctx, object, "enableLegacy",
                 JS_NewBool(config->enable_legacy)) &&
             esp32_mquickjs_set_property_ref(
                 ctx, object, "forceLegacyLtf",
                 JS_NewBool(config->force_legacy_ltf)) &&
             esp32_mquickjs_set_property_ref(
                 ctx, object, "ht20", JS_NewBool(config->ht20)) &&
             esp32_mquickjs_set_property_ref(
                 ctx, object, "ht40", JS_NewBool(config->ht40)) &&
             esp32_mquickjs_set_property_ref(
                 ctx, object, "vht", JS_NewBool(config->vht)) &&
             esp32_mquickjs_set_property_ref(
                 ctx, object, "heSu", JS_NewBool(config->he_su)) &&
             esp32_mquickjs_set_property_ref(
                 ctx, object, "heMu", JS_NewBool(config->he_mu)) &&
             esp32_mquickjs_set_property_ref(
                 ctx, object, "heDcm", JS_NewBool(config->he_dcm)) &&
             esp32_mquickjs_set_property_ref(
                 ctx, object, "heBeamformed",
                 JS_NewBool(config->he_beamformed)) &&
             esp32_mquickjs_set_property_ref(
                 ctx, object, "heStbcLtf", JS_NewString(ctx, stbc)) &&
             esp32_mquickjs_set_property_ref(
                 ctx, object, "valueScale",
                 JS_NewUint32(ctx, config->value_scale)) &&
             esp32_mquickjs_set_property_ref(
                 ctx, object, "dumpAck", JS_NewBool(config->dump_ack)) &&
             esp32_mquickjs_set_property_ref(
                 ctx, object, "lltfBits",
                 JS_NewUint32(ctx, config->lltf_bits));
    }
    if (!ok) goto fail;
    JS_PopGCRef(ctx, &scale_ref);
    return JS_PopGCRef(ctx, &object_ref);

fail:
    JS_PopGCRef(ctx, &scale_ref);
    JS_PopGCRef(ctx, &object_ref);
    return JS_EXCEPTION;
}

static JSValue wifi_csi_source_to_js(JSContext *ctx, const wifi_csi_options_t *options)
{
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "mode",
            JS_NewString(ctx, wifi_csi_source_name(options->source)))) goto fail;
    if (options->source == WIFI_CSI_SOURCE_PROMISCUOUS &&
        !esp32_mquickjs_set_property_ref(ctx, result, "channel", options->fixed_channel
            ? JS_NewUint32(ctx, options->channel) : JS_NewString(ctx, "current"))) goto fail;
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref);
    return JS_EXCEPTION;
}

