99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_csi/esp32_mquickjs_wifi_csi.c
static JSValue wifi_csi_requested_to_js(JSContext *ctx,
                                        const wifi_csi_options_t *options)
{
    JSGCRef result_ref, capture_ref, filter_ref, queue_ref;
    JSGCRef source_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *capture = JS_PushGCRef(ctx, &capture_ref);
    JSValue *filter = JS_PushGCRef(ctx, &filter_ref);
    JSValue *queue = JS_PushGCRef(ctx, &queue_ref);
    JSValue *source = JS_PushGCRef(ctx, &source_ref);

    *result = JS_NewObject(ctx);
    *capture = wifi_csi_capture_to_js(ctx, options);
    *filter = JS_NewObject(ctx);
    *queue = JS_NewObject(ctx);
    *source = wifi_csi_source_to_js(ctx, options);
    if (JS_IsException(*result) || JS_IsException(*capture) ||
        JS_IsException(*filter) || JS_IsException(*queue) ||
        JS_IsException(*source) ||
        (options->filter.source_mac_count && !esp32_mquickjs_set_property_ref(ctx, filter, "sourceMac",
            wifi_csi_mac_array(ctx, options->filter.source_macs, options->filter.source_mac_count))) ||
        (options->filter.destination_mac_count && !esp32_mquickjs_set_property_ref(ctx, filter, "destinationMac",
            wifi_csi_mac_array(ctx, options->filter.destination_macs, options->filter.destination_mac_count))) ||
        (options->filter.bssid_count && !esp32_mquickjs_set_property_ref(ctx, filter, "bssid",
            wifi_csi_mac_array(ctx, options->filter.bssids, options->filter.bssid_count))) ||
        (options->filter.frame_types_set && !esp32_mquickjs_set_property_ref(ctx, filter, "types",
            wifi_csi_frame_filter_to_js(ctx, options->filter.frame_types, false))) ||
        (options->filter.frame_subtypes_set && !esp32_mquickjs_set_property_ref(ctx, filter, "subtypes",
            wifi_csi_frame_filter_to_js(ctx, options->filter.frame_subtypes, true))) ||
        (options->filter.frame_filter && !esp32_mquickjs_set_property_ref(ctx, filter, "frames",
            esp32_mquickjs_wifi_frame_filter_to_js(ctx, options->filter.frame_subtype_masks))) ||
        (options->filter.minimum_rssi_set && !esp32_mquickjs_set_property_ref(
            ctx, filter, "minimumRssi", JS_NewInt32(ctx, options->filter.minimum_rssi))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, filter, "sampleEvery",
            JS_NewUint32(ctx, options->filter.sample_every)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, filter, "maximumRateHz",
            JS_NewUint32(ctx, options->filter.maximum_rate_hz)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, filter, "validOnly",
            JS_NewBool(options->filter.valid_only)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, queue, "poolCapacity",
            JS_NewUint32(ctx, options->pool_capacity)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, queue, "queueCapacity",
            JS_NewUint32(ctx, options->queue_capacity)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, queue, "overflow", JS_NewString(ctx, "drop-newest")) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "source", *source) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "capture", *capture) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "filter", *filter) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "buffering", *queue) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "packet", wifi_csi_packet_options_to_js(ctx, &options->packet))) goto fail;
    *capture = JS_UNDEFINED;
    *filter = JS_UNDEFINED;
    *queue = JS_UNDEFINED;
    JS_PopGCRef(ctx, &source_ref);
    JS_PopGCRef(ctx, &queue_ref);
    JS_PopGCRef(ctx, &filter_ref);
    JS_PopGCRef(ctx, &capture_ref);
    return JS_PopGCRef(ctx, &result_ref);

fail:
    JS_PopGCRef(ctx, &source_ref);
    JS_PopGCRef(ctx, &queue_ref);
    JS_PopGCRef(ctx, &filter_ref);
    JS_PopGCRef(ctx, &capture_ref);
    JS_PopGCRef(ctx, &result_ref);
    return JS_EXCEPTION;
}

static const char *wifi_csi_sample_encoding_name(
    esp32_mquickjs_wifi_csi_sample_encoding_t encoding)
{
    switch (encoding) {
        case ESP32_MQUICKJS_WIFI_CSI_SAMPLE_ENCODING_SIGNED_INT8:
            return "signed-int8";
        case ESP32_MQUICKJS_WIFI_CSI_SAMPLE_ENCODING_SIGNED_INT12_LE:
            return "signed-int12-le";
        case ESP32_MQUICKJS_WIFI_CSI_SAMPLE_ENCODING_SIGNED_INT12_PACKED:
            return "signed-int12-packed";
        default:
            return "unknown";
    }
}

static const char *wifi_csi_layout_schema_name(
    esp32_mquickjs_wifi_csi_layout_schema_t schema)
{
    switch (schema) {
        case ESP32_MQUICKJS_WIFI_CSI_LAYOUT_SCHEMA_LEGACY:
            return "wifi-csi-legacy-layout/1";
        case ESP32_MQUICKJS_WIFI_CSI_LAYOUT_SCHEMA_HE:
            return "wifi-csi-he-layout/1";
        default:
            return "unknown";
    }
}

static const char *wifi_csi_segment_type_name(
    esp32_mquickjs_wifi_csi_segment_type_t type)
{
    switch (type) {
        case ESP32_MQUICKJS_WIFI_CSI_SEGMENT_LLTF: return "lltf";
        case ESP32_MQUICKJS_WIFI_CSI_SEGMENT_HT_LTF: return "ht-ltf";
        case ESP32_MQUICKJS_WIFI_CSI_SEGMENT_STBC_HT_LTF2:
            return "stbc-ht-ltf2";
        case ESP32_MQUICKJS_WIFI_CSI_SEGMENT_VHT_LTF: return "vht-ltf";
        case ESP32_MQUICKJS_WIFI_CSI_SEGMENT_HE_LTF1: return "he-ltf1";
        case ESP32_MQUICKJS_WIFI_CSI_SEGMENT_HE_LTF2: return "he-ltf2";
        case ESP32_MQUICKJS_WIFI_CSI_SEGMENT_MIXED: return "mixed";
        default: return "unknown";
    }
}

static JSValue wifi_csi_layout_to_js(
    JSContext *ctx, const esp32_mquickjs_wifi_csi_layout_t *native_layout)
{
    JSGCRef layout_ref, segments_ref, segment_ref, ranges_ref;
    JSGCRef range_ref, nulls_ref, item_ref;
    JSValue *layout = JS_PushGCRef(ctx, &layout_ref);
    JSValue *segments = JS_PushGCRef(ctx, &segments_ref);
    JSValue *segment = JS_PushGCRef(ctx, &segment_ref);
    JSValue *ranges = JS_PushGCRef(ctx, &ranges_ref);
    JSValue *range = JS_PushGCRef(ctx, &range_ref);
    JSValue *nulls = JS_PushGCRef(ctx, &nulls_ref);
    JSValue *item = JS_PushGCRef(ctx, &item_ref);
    uint8_t segment_index;

    *layout = JS_NewObject(ctx);
    *segments = JS_NewArray(ctx, native_layout->segment_count);
    *segment = JS_UNDEFINED;
    *ranges = JS_UNDEFINED;
    *range = JS_UNDEFINED;
    *nulls = JS_UNDEFINED;
    *item = JS_UNDEFINED;
    if (JS_IsException(*layout) || JS_IsException(*segments)) goto fail;
    for (segment_index = 0U;
         segment_index < native_layout->segment_count;
         ++segment_index) {
        const esp32_mquickjs_wifi_csi_segment_t *native_segment =
            &native_layout->segments[segment_index];
        uint8_t range_index;
        uint8_t null_index;

        *segment = JS_NewObject(ctx);
        *ranges = JS_NewArray(ctx, native_segment->subcarrier_range_count);
        *nulls = JS_NewArray(ctx, native_segment->null_subcarrier_count);
        if (JS_IsException(*segment) || JS_IsException(*ranges) ||
            JS_IsException(*nulls)) goto fail;
        for (range_index = 0U;
             range_index < native_segment->subcarrier_range_count;
             ++range_index) {
            *range = JS_NewObject(ctx);
            if (JS_IsException(*range) ||
                !esp32_mquickjs_set_property_ref(
                    ctx, range, "start",
                    JS_NewInt32(ctx,
                        native_segment->subcarrier_ranges[range_index].start)) ||
                !esp32_mquickjs_set_property_ref(
                    ctx, range, "end",
                    JS_NewInt32(ctx,
                        native_segment->subcarrier_ranges[range_index].end)) ||
                JS_IsException(JS_SetPropertyUint32(
                    ctx, *ranges, range_index, *range))) goto fail;
            *range = JS_UNDEFINED;
        }
        for (null_index = 0U;
             null_index < native_segment->null_subcarrier_count;
             ++null_index) {
            *item = JS_NewInt32(
                ctx, native_segment->null_subcarriers[null_index]);
            if (JS_IsException(*item) ||
                JS_IsException(JS_SetPropertyUint32(
                    ctx, *nulls, null_index, *item))) goto fail;
            *item = JS_UNDEFINED;
        }
        if (!esp32_mquickjs_set_property_ref(
                ctx, segment, "type", JS_NewString(
                    ctx, wifi_csi_segment_type_name(native_segment->type))) ||
            !esp32_mquickjs_set_property_ref(
                ctx, segment, "offsetBytes",
                JS_NewUint32(ctx, native_segment->offset_bytes)) ||
            !esp32_mquickjs_set_property_ref(
                ctx, segment, "lengthBytes",
                JS_NewUint32(ctx, native_segment->length_bytes)) ||
            !esp32_mquickjs_set_property_ref(
                ctx, segment, "iqPairCount",
                JS_NewUint32(ctx, native_segment->iq_pair_count)) ||
            !esp32_mquickjs_set_property_ref(
                ctx, segment, "subcarrierRanges", *ranges) ||
            !esp32_mquickjs_set_property_ref(
                ctx, segment, "nullSubcarriers", *nulls) ||
            JS_IsException(JS_SetPropertyUint32(
                ctx, *segments, segment_index, *segment))) goto fail;
        *ranges = JS_UNDEFINED;
        *nulls = JS_UNDEFINED;
        *segment = JS_UNDEFINED;
    }
    if (!esp32_mquickjs_set_property_ref(
            ctx, layout, "schema", JS_NewString(
                ctx, wifi_csi_layout_schema_name(native_layout->schema))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, layout, "componentOrder",
            JS_NewString(ctx, "imaginary-real")) ||
        !esp32_mquickjs_set_property_ref(
            ctx, layout, "sampleEncoding", JS_NewString(
                ctx, wifi_csi_sample_encoding_name(
                    native_layout->sample_encoding))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, layout, "sampleBits", native_layout->sample_bits > 0U
                ? JS_NewUint32(ctx, native_layout->sample_bits) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(
            ctx, layout, "byteLength",
            JS_NewUint32(ctx, native_layout->byte_length)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, layout, "iqPairCount",
            JS_NewUint32(ctx, native_layout->iq_pair_count)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, layout, "trailingPaddingBytes",
            JS_NewUint32(ctx, native_layout->trailing_padding_bytes)) ||
        !esp32_mquickjs_set_property_ref(ctx, layout, "segments", *segments))
        goto fail;
    *segments = JS_UNDEFINED;
    JS_PopGCRef(ctx, &item_ref);
    JS_PopGCRef(ctx, &nulls_ref);
    JS_PopGCRef(ctx, &range_ref);
    JS_PopGCRef(ctx, &ranges_ref);
    JS_PopGCRef(ctx, &segment_ref);
    JS_PopGCRef(ctx, &segments_ref);
    return JS_PopGCRef(ctx, &layout_ref);

