99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_csi/esp32_mquickjs_wifi_csi.c
fail:
    JS_PopGCRef(ctx, &item_ref);
    JS_PopGCRef(ctx, &nulls_ref);
    JS_PopGCRef(ctx, &range_ref);
    JS_PopGCRef(ctx, &ranges_ref);
    JS_PopGCRef(ctx, &segment_ref);
    JS_PopGCRef(ctx, &segments_ref);
    JS_PopGCRef(ctx, &layout_ref);
    return JS_EXCEPTION;
}

static JSValue wifi_csi_packet_to_js(JSContext *ctx, const esp32_mquickjs_wifi_csi_packet_t *packet)
{
    if (packet == NULL || packet->length == 0) return JS_NULL;
    const esp32_mquickjs_wifi_rx_header_t *header = &packet->header;
    static const char *const types[] = {"management", "control", "data", "misc", "unknown"};
    static const char *const flags[] = {"toDs", "fromDs", "moreFragments", "retry",
        "powerManagement", "moreData", "protected", "order"};
    JSGCRef result_ref, child_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *child = JS_PushGCRef(ctx, &child_ref);
    *result = JS_NewObject(ctx);
    *child = JS_NewObject(ctx);
#define PACKET_SET(object, key, value) do { if (!esp32_mquickjs_set_property_ref(ctx, object, key, value)) goto fail; } while (0)
#define PACKET_NUMBER(object, key, value) PACKET_SET(object, key, JS_NewUint32(ctx, value))
    if (JS_IsException(*result) || JS_IsException(*child)) goto fail;
    PACKET_SET(result, "category", JS_NewString(ctx, types[(unsigned)header->type < 5 ? header->type : 4]));
    PACKET_SET(result, "frameType", esp32_mquickjs_wifi_frame_type_to_js(ctx,
        (header->frame_control >> 2) & 3, (header->frame_control >> 4) & 15));
    PACKET_NUMBER(result, "frameControl", header->frame_control);
    PACKET_NUMBER(result, "durationId", header->duration_id);
    PACKET_SET(result, "sequenceControl", header->sequence_valid ? JS_NewUint32(ctx, header->sequence_control) : JS_NULL);
    PACKET_SET(result, "qosControl", header->qos_valid ? JS_NewUint32(ctx, header->qos_control) : JS_NULL);
    for (unsigned i = 0; i < 8; ++i)
        PACKET_SET(child, flags[i], JS_NewBool((header->frame_control & (1U << (8 + i))) != 0));
    PACKET_SET(result, "flags", *child);
    *child = JS_NewObject(ctx);
    if (JS_IsException(*child)) goto fail;
    PACKET_SET(child, "mode", JS_NewString(ctx, wifi_csi_packet_mode_name(packet->mode)));
    PACKET_NUMBER(child, "headerLength", header->header_length);
    PACKET_NUMBER(child, "payloadLength", packet->readable_length - header->header_length);
    PACKET_NUMBER(child, "driverLength", packet->driver_packet_length);
    PACKET_NUMBER(child, "driverPayloadLength", packet->driver_payload_length);
    PACKET_NUMBER(child, "readableLength", packet->readable_length);
    PACKET_NUMBER(child, "capturedLength", packet->length);
    PACKET_NUMBER(child, "payloadCapturedLength", packet->length - header->header_length);
    PACKET_SET(child, "truncated", JS_NewBool(packet->truncated));
    PACKET_SET(child, "fcs", JS_NewString(ctx, "unknown"));
    PACKET_SET(child, "payloadRepresentation", JS_NewString(ctx, "unknown"));
    PACKET_SET(child, "pointerLayoutValid", JS_TRUE);
    PACKET_SET(child, "parseValid", JS_TRUE);
    PACKET_SET(result, "capture", *child);
    JS_PopGCRef(ctx, &child_ref);
    return JS_PopGCRef(ctx, &result_ref);
fail:
    JS_PopGCRef(ctx, &child_ref);
    JS_PopGCRef(ctx, &result_ref);
    return JS_EXCEPTION;
#undef PACKET_NUMBER
#undef PACKET_SET
}

static JSValue wifi_csi_frame_info_to_js(
    JSContext *ctx, const esp32_mquickjs_wifi_csi_slot_t *slot)
{
    const esp32_mquickjs_wifi_csi_metadata_t *m = &slot->metadata;
    JSGCRef result_ref, child_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *child = JS_PushGCRef(ctx, &child_ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
#define INFO_SET(object, key, value) do { if (!esp32_mquickjs_set_property_ref(ctx, object, key, value)) goto fail; } while (0)
#define INFO_NUMBER(object, key, value) INFO_SET(object, key, JS_NewUint32(ctx, value))
#define INFO_CHILD() do { *child = JS_NewObject(ctx); if (JS_IsException(*child)) goto fail; } while (0)
#define PHY_BOOL(key, available, value) INFO_SET(child, key, (m->phy_flags & ESP32_MQUICKJS_WIFI_RX_WIRE_##available) \
    ? JS_NewBool((m->phy_flags & ESP32_MQUICKJS_WIFI_RX_WIRE_##value) != 0) : JS_NULL)
    INFO_NUMBER(result, "sequence", slot->sequence);
    INFO_NUMBER(result, "generation", slot->session_generation);
    INFO_NUMBER(result, "radioGeneration", m->radio_generation);
    INFO_SET(result, "timestampUs", JS_NewInt64(ctx, (int64_t)m->timestamp_us));
    INFO_SET(result, "timestampAccuracy", JS_NewString(ctx, "callback-time"));
    INFO_SET(result, "rxSequence", m->rx_sequence != UINT32_MAX ? JS_NewUint32(ctx, m->rx_sequence) : JS_NULL);
    INFO_CHILD();
    INFO_SET(child, "rssi", JS_NewInt32(ctx, m->rssi));
    INFO_SET(child, "noiseFloor", m->noise_floor_available ? JS_NewInt32(ctx, m->noise_floor) : JS_NULL);
    INFO_SET(child, "antenna", m->antenna_available ? JS_NewUint32(ctx, m->antenna) : JS_NULL);
    INFO_SET(result, "signal", *child);
    INFO_CHILD();
    INFO_SET(child, "band", m->channel >= 1 && m->channel <= 14 ? JS_NewString(ctx, "2.4GHz") :
        m->channel >= 32 && m->channel <= 177 ? JS_NewString(ctx, "5GHz") : JS_NULL);
    INFO_NUMBER(child, "primary", m->channel);
    INFO_SET(child, "secondary", (unsigned)m->secondary <= ESP32_MQUICKJS_WIFI_CSI_SECONDARY_BELOW
        ? JS_NewString(ctx, wifi_csi_secondary_name(m->secondary)) : JS_NULL);
    INFO_SET(result, "channel", *child);
    INFO_CHILD();
    INFO_SET(child, "format", JS_NewString(ctx, wifi_csi_phy_name(m->phy)));
    INFO_SET(child, "bandwidthMHz", m->bandwidth_available ? JS_NewUint32(ctx, m->bandwidth_mhz) : JS_NULL);
    INFO_SET(child, "guardIntervalNs", m->guard_interval_ns ? JS_NewUint32(ctx, m->guard_interval_ns) : JS_NULL);
    INFO_SET(child, "heLtfSize", m->he_ltf_size ? JS_NewUint32(ctx, m->he_ltf_size) : JS_NULL);
    INFO_SET(child, "dcm", m->dcm_state ? JS_NewBool(m->dcm_state == 2) : JS_NULL);
    INFO_SET(child, "mcs", m->mcs_available ? JS_NewUint32(ctx, m->mcs) : JS_NULL);
    INFO_SET(child, "legacyRate", JS_NULL); /* Raw rate codes have no proven bitrate mapping. */
    INFO_SET(child, "stbc", m->stbc_available ? JS_NewBool(m->stbc) : JS_NULL);
    PHY_BOOL("shortGuardInterval", SGI_AVAILABLE, SGI);
    PHY_BOOL("aggregation", AGGREGATION_AVAILABLE, AGGREGATION);
    PHY_BOOL("smoothingRecommended", SMOOTHING_AVAILABLE, SMOOTHING);
    PHY_BOOL("sounding", SOUNDING_AVAILABLE, SOUNDING);
    INFO_SET(child, "fecCoding", (m->phy_flags & ESP32_MQUICKJS_WIFI_RX_WIRE_FEC_AVAILABLE)
        ? JS_NewString(ctx, (m->phy_flags & ESP32_MQUICKJS_WIFI_RX_WIRE_LDPC) ? "ldpc" : "bcc") : JS_NULL);
    INFO_SET(child, "ampduCount", m->ampdu_count_available ? JS_NewUint32(ctx, m->ampdu_count) : JS_NULL);
    INFO_SET(result, "phy", *child);
    INFO_CHILD();
    static const char *const roles[] = {"source", "destination", "transmitter", "receiver", "bssid"};
    for (unsigned i = 0; i < ESP32_MQUICKJS_WIFI_RX_ADDRESS_COUNT; ++i) {
        char address[18];
        wifi_csi_format_mac(m->addresses[i], address);
        INFO_SET(child, roles[i], (m->address_mask & (1U << i)) ? JS_NewString(ctx, address) : JS_NULL);
    }
    INFO_SET(result, "addresses", *child);
    INFO_CHILD();
    INFO_SET(child, "firstWordInvalid", JS_NewBool(m->first_word_invalid));
    INFO_SET(child, "channelEstimateValid", m->channel_estimate_valid_available ? JS_NewBool(m->channel_estimate_valid) : JS_NULL);
    INFO_SET(child, "callbackDataValid", JS_TRUE);
    INFO_SET(child, "layoutKnown", JS_NewBool(m->layout.known));
    INFO_SET(result, "validity", *child);
    INFO_SET(result, "layout", wifi_csi_layout_to_js(ctx, &m->layout));
    INFO_SET(result, "packet", wifi_csi_packet_to_js(ctx, slot->packet));
    JS_PopGCRef(ctx, &child_ref);
    return JS_PopGCRef(ctx, &result_ref);
fail:
    JS_PopGCRef(ctx, &child_ref);
    JS_PopGCRef(ctx, &result_ref);
    return JS_EXCEPTION;
#undef PHY_BOOL
#undef INFO_CHILD
#undef INFO_NUMBER
#undef INFO_SET
}

static JSValue wifi_csi_make_frame(
    JSContext *ctx, const esp32_mquickjs_wifi_csi_event_t *event)
{
    esp32_mquickjs_wifi_csi_slot_t *slot = wifi_csi_resolve_event(event);
    wifi_csi_frame_ref_t *ref;
    JSGCRef object_ref, info_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *info = JS_PushGCRef(ctx, &info_ref);

    *object = JS_UNDEFINED;
    *info = JS_UNDEFINED;
    if (slot == NULL) {
        JS_ThrowReferenceError(ctx,
            "WIFI_CSI_STALE_FRAME: receive event is stale");
        goto fail;
    }
    if (!wifi_csi_update_event(event, WIFI_CSI_EVENT_TAKE)) {
        JS_ThrowReferenceError(ctx,
            "WIFI_CSI_STALE_FRAME: receive event owner was already consumed");
        goto fail;
    }
    *object = JS_NewObjectClassUser(ctx, JS_CLASS_WIFI_CSI_FRAME);
    if (JS_IsException(*object)) goto fail_close;
    ref = esp32_mquickjs_memory_wireless_calloc("wifi.csi", 1, sizeof(*ref), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (ref == NULL) {
        JS_ThrowOutOfMemory(ctx);
        goto fail_close;
    }
    ref->session_generation = event->session_generation;
    ref->slot_index = event->slot_index;
    ref->slot_generation = event->slot_generation;
    JS_SetOpaque(ctx, *object, ref);
    *info = wifi_csi_frame_info_to_js(ctx, slot);
    if (JS_IsException(*info) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "info", *info)) {
        JS_SetOpaque(ctx, *object, NULL);
        esp32_mquickjs_memory_payload_free(ref);
        goto fail_close;
    }
    *info = JS_UNDEFINED;
    (void)wifi_csi_update_event(event, WIFI_CSI_EVENT_DELIVERED);
    JS_PopGCRef(ctx, &info_ref);
    return JS_PopGCRef(ctx, &object_ref);

