99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_csi/esp32_mquickjs_wifi_csi.c
fail_close:
    {
        wifi_csi_lease_ref_t lease = {.event = *event};
        wifi_csi_lease_request_close(&lease);
    }
fail:
    JS_PopGCRef(ctx, &info_ref);
    JS_PopGCRef(ctx, &object_ref);
    return JS_EXCEPTION;
}

static JSValue wifi_csi_event_to_js(JSContext *ctx,
                                    const void *event,
                                    void *opaque)
{
    (void)opaque;
    return wifi_csi_make_frame(ctx, event);
}

static bool wifi_csi_sample_source_next(
    JSContext *ctx, void *opaque, esp32_mquickjs_byte_span_t *out)
{
    wifi_csi_sample_source_t *source = opaque;
    esp32_mquickjs_wifi_csi_slot_t *slot;
    (void)ctx;
    if (source == NULL || source->lease.released ||
        (slot = wifi_csi_resolve_event(&source->lease.event)) == NULL) return false;
    size_t length = source->packet ? (slot->packet != NULL ? slot->packet->length : 0) : slot->length;
    if (source->offset >= length) return false;
    const uint8_t *bytes = source->packet ? slot->packet->bytes : slot->payload;
    out->data = bytes + source->offset;
    out->length = length - source->offset;
    out->owner = JS_UNDEFINED;
    out->dma_capable = false;
    source->offset = length;
    return true;
}

static void wifi_csi_sample_source_iterator_close(JSContext *ctx, void *opaque)
{
    wifi_csi_sample_source_t *source = opaque;

    (void)ctx;
    if (source == NULL) return;
    source->iterator_active = false;
    wifi_csi_lease_release(&source->lease);
    if (source->destroy_requested) esp32_mquickjs_memory_payload_free(source);
}

static bool wifi_csi_sample_source_open(
    JSContext *ctx, JSValue source_value, void *opaque,
    esp32_mquickjs_byte_span_source_t *out, JSValue *out_error)
{
    wifi_csi_sample_source_t *source = opaque;

    (void)source_value;
    if (source == NULL || source->opened || source->lease.released ||
        wifi_csi_resolve_event(&source->lease.event) == NULL) {
        *out_error = JS_ThrowReferenceError(
            ctx, "WIFI_CSI_STALE_FRAME: frame source is closed or consumed");
        return false;
    }
    source->opened = true;
    source->iterator_active = true;
    out->opaque = source;
    out->next = wifi_csi_sample_source_next;
    out->close = wifi_csi_sample_source_iterator_close;
    return true;
}

static size_t wifi_csi_sample_source_known_length(void *opaque)
{
    wifi_csi_sample_source_t *source = opaque;
    esp32_mquickjs_wifi_csi_slot_t *slot = source != NULL
        ? wifi_csi_resolve_event(&source->lease.event) : NULL;

    return slot != NULL && !source->lease.released
        ? (source->packet ? (slot->packet != NULL ? slot->packet->length : 0) : slot->length) : 0U;
}

static void wifi_csi_sample_source_destroy(JSContext *ctx, void *opaque)
{
    wifi_csi_sample_source_t *source = opaque;

    (void)ctx;
    if (source == NULL) return;
    if (source->iterator_active) {
        source->destroy_requested = true;
        return;
    }
    wifi_csi_lease_release(&source->lease);
    esp32_mquickjs_memory_payload_free(source);
}

static const esp32_mquickjs_byte_span_source_object_ops_t
    s_wifi_csi_sample_source_ops = {
        .class_id = JS_CLASS_BYTE_SPAN_SOURCE,
        .open = wifi_csi_sample_source_open,
        .known_length = wifi_csi_sample_source_known_length,
        .destroy = wifi_csi_sample_source_destroy,
    };

static bool wifi_csi_wire_source_build_control(wifi_csi_wire_source_t *source, bool *invalid)
{
    *invalid = true;
    if (source->frame_count == 0 || source->frame_count > ESP32_MQUICKJS_WIFI_RX_WIRE_MAX_FRAMES) return false;
    esp32_mquickjs_wifi_rx_wire_frame_t *frames = esp32_mquickjs_memory_wireless_calloc("wifi.csi", source->frame_count, sizeof(*frames), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_COPY);
    if (frames == NULL) { *invalid = false; return false; }
    bool success = false;
    for (uint16_t i = 0; i < source->frame_count; ++i) {
        esp32_mquickjs_wifi_csi_slot_t *slot = wifi_csi_resolve_event(&source->leases[i].event);
        esp32_mquickjs_wifi_csi_wire_snapshot_t snapshot;
        if (!esp32_mquickjs_wifi_csi_wire_snapshot(slot, &snapshot)) goto done;
        frames[i] = snapshot.frame;
    }
    esp32_mquickjs_wifi_rx_wire_layout_t layout;
    if (!esp32_mquickjs_wifi_rx_wire_layout(ESP32_MQUICKJS_WIFI_RX_WIRE_CSI, frames, source->frame_count, &layout)) goto done;
    source->control = esp32_mquickjs_memory_wireless_calloc("wifi.csi", 1, layout.control_bytes, ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_COPY);
    if (source->control == NULL) { *invalid = false; goto done; }
    source->control_length = layout.control_bytes;
    source->total_length = layout.total_bytes;
    if (!esp32_mquickjs_wifi_rx_wire_write_control(ESP32_MQUICKJS_WIFI_RX_WIRE_CSI, frames,
            source->frame_count, source->control, source->control_length)) goto done;
    for (uint16_t i = 0; i < source->frame_count; ++i) {
        esp32_mquickjs_wifi_csi_slot_t *slot = wifi_csi_resolve_event(&source->leases[i].event);
        esp32_mquickjs_wifi_csi_wire_snapshot_t snapshot;
        if (!esp32_mquickjs_wifi_csi_wire_snapshot(slot, &snapshot) ||
            !esp32_mquickjs_wifi_rx_wire_write_metadata(ESP32_MQUICKJS_WIFI_RX_WIRE_CSI, &frames[i], &snapshot.metadata,
                source->control + layout.metadata_base + (size_t)i * WIFI_CSI_BATCH_METADATA_BYTES,
                WIFI_CSI_BATCH_METADATA_BYTES)) goto done;
    }
    success = true;
done:
    esp32_mquickjs_memory_payload_free(frames);
    return success;
}

static void wifi_csi_wire_source_release(wifi_csi_wire_source_t *source)
{
    if (source == NULL) return;
    for (uint16_t index = 0; index < source->retained_count; ++index)
        wifi_csi_lease_release(&source->leases[index]);
    source->retained_count = 0;
    esp32_mquickjs_memory_payload_free(source->control);
    source->control = NULL;
}

static bool wifi_csi_wire_source_next(
    JSContext *ctx, void *opaque, esp32_mquickjs_byte_span_t *out)
{
    wifi_csi_wire_source_t *source = opaque;

    (void)ctx;
    if (source == NULL || source->retained_count == 0) return false;
    if (!source->control_emitted) {
        source->control_emitted = true;
        out->data = source->control;
        out->length = source->control_length;
        out->owner = JS_UNDEFINED;
        out->dma_capable = false;
        return true;
    }
    if (source->padding_pending != 0) {
        static const uint8_t padding[3] = {0};
        out->data = padding;
        out->length = source->padding_pending;
        out->owner = JS_UNDEFINED;
        out->dma_capable = false;
        source->padding_pending = 0;
        return true;
    }
    while (source->payload_index < source->frame_count) {
        wifi_csi_lease_ref_t *lease = &source->leases[source->payload_index];
        esp32_mquickjs_wifi_csi_slot_t *slot = wifi_csi_resolve_event(&lease->event);
        if (slot == NULL || lease->released) {
            (void)JS_ThrowReferenceError(ctx, "WIFI_CSI_STALE_FRAME: retained source slot unavailable");
            return false;
        }
        if (!source->packet_pending) {
            out->data = slot->payload;
            out->length = slot->length;
            source->packet_pending = true;
        } else {
            ++source->payload_index;
            source->packet_pending = false;
            if (slot->packet == NULL || slot->packet->length == 0) continue;
            out->data = slot->packet->bytes;
            out->length = slot->packet->length;
        }
        out->owner = JS_UNDEFINED;
        out->dma_capable = false;
        source->padding_pending = (uint8_t)((4U - (out->length & 3U)) & 3U);
        return true;
    }
    return false;
}

static void wifi_csi_wire_source_iterator_close(JSContext *ctx, void *opaque)
{
    wifi_csi_wire_source_t *source = opaque;

    (void)ctx;
    if (source == NULL) return;
    source->iterator_active = false;
    wifi_csi_wire_source_release(source);
    if (source->destroy_requested) {
        esp32_mquickjs_memory_payload_free(source);
    }
}

static bool wifi_csi_wire_source_open(
    JSContext *ctx, JSValue source_value, void *opaque,
    esp32_mquickjs_byte_span_source_t *out, JSValue *out_error)
{
    wifi_csi_wire_source_t *source = opaque;

    (void)source_value;
    if (source == NULL || source->opened) {
        *out_error = JS_ThrowReferenceError(
            ctx, "CSI wire Source is closed or consumed");
        return false;
    }
    source->opened = true;
    source->iterator_active = true;
    out->opaque = source;
    out->next = wifi_csi_wire_source_next;
    out->close = wifi_csi_wire_source_iterator_close;
    return true;
}

