99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_csi/esp32_mquickjs_wifi_csi.c
static size_t wifi_csi_wire_source_known_length(void *opaque)
{
    wifi_csi_wire_source_t *source = opaque;
    return source != NULL ? source->total_length : 0;
}

static void wifi_csi_wire_source_destroy(JSContext *ctx, void *opaque)
{
    wifi_csi_wire_source_t *source = opaque;

    (void)ctx;
    if (source == NULL) return;
    if (source->iterator_active) {
        source->destroy_requested = true;
        return;
    }
    wifi_csi_wire_source_release(source);
    esp32_mquickjs_memory_payload_free(source);
}

static const esp32_mquickjs_byte_span_source_object_ops_t
    s_wifi_csi_wire_source_ops = {
        .class_id = JS_CLASS_BYTE_SPAN_SOURCE,
        .open = wifi_csi_wire_source_open,
        .known_length = wifi_csi_wire_source_known_length,
        .destroy = wifi_csi_wire_source_destroy,
    };

/* Capture before resolving Frame/Batch native adapters. JS property access may
 * close the owner, collect it, or throw; preserve that exception unchanged. */
static bool wifi_csi_capture_source_options(JSContext *ctx, int argc, JSValue *argv)
{
    static const char *const allowed[] = {"format"};
    if (argc != 1) {
        JS_ThrowTypeError(ctx, "CSI Source expects {format: 'esp32qjs-csi/1'}"); return false;
    }
    if (!esp32_mquickjs_validate_plain_options(ctx, argv[0], "CSI Source", allowed, 1U)) return false;
    JSValue format = JS_GetPropertyStr(ctx, argv[0], "format");
    if (JS_IsException(format)) return false;
    if (!wifi_csi_string_equals(ctx, format, "esp32qjs-csi/1")) {
        if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx, "CSI Source format must be esp32qjs-csi/1");
        return false;
    }
    return true;
}

/* Copies exact event identities before the first JS allocation. Source owns its
 * leases without retaining the JS Frame/Batch or their copied metadata objects. */
static JSValue wifi_csi_new_wire_source(JSContext *ctx,
    const esp32_mquickjs_wifi_csi_event_t *events, uint16_t count)
{
    if (events == NULL || count == 0 || count > ESP32_MQUICKJS_WIFI_RX_WIRE_MAX_FRAMES)
        return JS_ThrowInternalError(ctx, "WIFI_CSI_INVALID_DATA: invalid Source frame count");
    wifi_csi_wire_source_t *source = esp32_mquickjs_memory_wireless_calloc("wifi.csi", 1, sizeof(*source) + (size_t)count * sizeof(source->leases[0]), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (source == NULL) return JS_ThrowOutOfMemory(ctx);
    source->frame_count = count;
    bool invalid = true;
    for (uint16_t index = 0; index < count; ++index) {
        if (!wifi_csi_update_event(&events[index], WIFI_CSI_EVENT_RETAIN)) goto fail;
        source->leases[index].event = events[index];
        ++source->retained_count;
    }
    if (!wifi_csi_wire_source_build_control(source, &invalid)) goto fail;
    return esp32_mquickjs_new_wireless_byte_span_source("wifi.csi", ctx, JS_UNDEFINED, &s_wifi_csi_wire_source_ops, source);
fail:
    wifi_csi_wire_source_release(source);
    esp32_mquickjs_memory_payload_free(source);
    return invalid ? JS_ThrowInternalError(ctx, "WIFI_CSI_INVALID_DATA: retained source metadata is invalid") :
        JS_ThrowOutOfMemory(ctx);
}

static wifi_csi_session_t *wifi_csi_session_from_value(
    JSContext *ctx, JSValue value, bool allow_closed)
{
    wifi_csi_session_ref_t *ref;
    wifi_csi_lifecycle_t lifecycle;

    if (JS_GetClassID(ctx, value) != JS_CLASS_WIFI_CSI_SESSION ||
        (ref = JS_GetOpaque(ctx, value)) == NULL) {
        JS_ThrowTypeError(ctx, "expected a WiFiCsiSession");
        return NULL;
    }
    lifecycle = atomic_load_explicit(&s_wifi_csi.lifecycle,
                                     memory_order_acquire);
    if (ref->generation != s_wifi_csi.generation ||
        (!allow_closed && lifecycle == WIFI_CSI_CLOSED)) {
        JS_ThrowReferenceError(ctx,
            "WIFI_CSI_NOT_OPEN: session is closed or stale");
        return NULL;
    }
    return &s_wifi_csi;
}

static esp32_mquickjs_wifi_csi_slot_t *wifi_csi_frame_from_value(
    JSContext *ctx, JSValue value, const char *api_name,
    wifi_csi_frame_ref_t **out_ref,
    esp32_mquickjs_wifi_csi_event_t *out_event)
{
    wifi_csi_frame_ref_t *ref;
    esp32_mquickjs_wifi_csi_event_t event;
    esp32_mquickjs_wifi_csi_slot_t *slot;

    if (JS_GetClassID(ctx, value) != JS_CLASS_WIFI_CSI_FRAME ||
        (ref = JS_GetOpaque(ctx, value)) == NULL || ref->closed) {
        JS_ThrowReferenceError(ctx,
            "WIFI_CSI_STALE_FRAME: %s requires an open frame", api_name);
        return NULL;
    }
    event.session_generation = ref->session_generation;
    event.slot_index = ref->slot_index;
    event.slot_generation = ref->slot_generation;
    slot = wifi_csi_resolve_event(&event);
    if (slot == NULL) {
        JS_ThrowReferenceError(ctx,
            "WIFI_CSI_STALE_FRAME: %s frame lease is stale", api_name);
        return NULL;
    }
    if (out_ref != NULL) *out_ref = ref;
    if (out_event != NULL) *out_event = event;
    return slot;
}

static wifi_csi_batch_ref_t *wifi_csi_batch_from_value(
    JSContext *ctx, JSValue value, const char *api_name)
{
    wifi_csi_batch_ref_t *batch;

    if (JS_GetClassID(ctx, value) != JS_CLASS_WIFI_CSI_BATCH ||
        (batch = JS_GetOpaque(ctx, value)) == NULL || batch->closed) {
        JS_ThrowReferenceError(ctx,
            "WIFI_CSI_STALE_FRAME: %s requires an open batch", api_name);
        return NULL;
    }
    return batch;
}

static JSValue wifi_csi_packet_capabilities(JSContext *ctx)
{
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx);
    bool ok = !JS_IsException(*result) &&
        esp32_mquickjs_set_property_ref(ctx, result, "header", JS_TRUE) &&
        esp32_mquickjs_set_property_ref(ctx, result, "full", JS_TRUE) &&
        esp32_mquickjs_set_property_ref(ctx, result, "required", JS_TRUE) &&
        esp32_mquickjs_set_property_ref(ctx, result, "requireComplete", JS_TRUE) &&
        esp32_mquickjs_set_property_ref(ctx, result, "maxHeaderBytes", JS_NewUint32(ctx, ESP32_MQUICKJS_WIFI_CSI_MAX_HEADER_BYTES)) &&
        esp32_mquickjs_set_property_ref(ctx, result, "maxPacketBytes", JS_NewUint32(ctx, ESP32_MQUICKJS_WIFI_CSI_MAX_PACKET_BYTES)) &&
        esp32_mquickjs_set_property_ref(ctx, result, "fcs", JS_NewString(ctx, "unknown")) &&
        esp32_mquickjs_set_property_ref(ctx, result, "payloadRepresentation", JS_NewString(ctx, "unknown")) &&
        esp32_mquickjs_set_property_ref(ctx, result, "qualification", JS_NewString(ctx, "candidate"));
    JSValue value = JS_PopGCRef(ctx, &ref);
    return ok ? value : JS_EXCEPTION;
}

