99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_csi/esp32_mquickjs_wifi_csi.c
JSValue js_wifi_csi_capabilities(JSContext *ctx, JSValue *this_val,
                                 int argc, JSValue *argv)
{
#if CONFIG_ESP32_MQUICKJS_WIFI_CSI_ALLOW_PROMISCUOUS
    static const char *const sources_promiscuous[] = {
        "associated", "promiscuous",
    };
#else
    static const char *const sources_associated[] = {"associated"};
#endif
    static const char *const phy_legacy[] = {"legacy", "ht"};
    static const char *const phy_he[] = {
        "legacy", "ht", "vht", "he-su", "he-mu", "he-er-su", "he-tb",
    };
    static const char *const phy_he_no_vht[] = {
        "legacy", "ht", "he-su", "he-mu", "he-er-su", "he-tb",
    };
    static const char *const encodings_legacy[] = {"signed-int8"};
    static const char *const encodings_he[] = {
        "signed-int8", "signed-int12-le", "signed-int12-packed",
    };
    JSGCRef result_ref, sources_ref, formats_ref, limits_ref, supports_ref;
    JSGCRef radio_ref, encodings_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *sources = JS_PushGCRef(ctx, &sources_ref);
    JSValue *formats = JS_PushGCRef(ctx, &formats_ref);
    JSValue *limits = JS_PushGCRef(ctx, &limits_ref);
    JSValue *supports = JS_PushGCRef(ctx, &supports_ref);
    JSValue *radio = JS_PushGCRef(ctx, &radio_ref);
    JSValue *encodings = JS_PushGCRef(ctx, &encodings_ref);
    bool he = esp32_mquickjs_wifi_csi_target_is_he();
    bool vht = esp32_mquickjs_wifi_csi_target_supports_vht();

    (void)this_val;
    (void)argc;
    (void)argv;
    *result = JS_NewObject(ctx);
#if CONFIG_ESP32_MQUICKJS_WIFI_CSI_ALLOW_PROMISCUOUS
    *sources = wifi_csi_string_array(
        ctx, sources_promiscuous, 2U);
#else
    *sources = wifi_csi_string_array(ctx, sources_associated, 1U);
#endif
    *formats = he
        ? (vht
            ? wifi_csi_string_array(
                ctx, phy_he, sizeof(phy_he) / sizeof(phy_he[0]))
            : wifi_csi_string_array(
                ctx, phy_he_no_vht,
                sizeof(phy_he_no_vht) / sizeof(phy_he_no_vht[0])))
        : wifi_csi_string_array(ctx, phy_legacy,
                                sizeof(phy_legacy) / sizeof(phy_legacy[0]));
    *limits = JS_NewObject(ctx);
    *supports = JS_NewObject(ctx);
    *radio = wifi_csi_radio_capabilities_to_js(ctx);
    *encodings = he
        ? wifi_csi_string_array(
            ctx, encodings_he, sizeof(encodings_he) / sizeof(encodings_he[0]))
        : wifi_csi_string_array(
            ctx, encodings_legacy,
            sizeof(encodings_legacy) / sizeof(encodings_legacy[0]));
    if (JS_IsException(*result) || JS_IsException(*sources) ||
        JS_IsException(*formats) || JS_IsException(*limits) ||
        JS_IsException(*supports) || JS_IsException(*radio) ||
        JS_IsException(*encodings) ||
        !esp32_mquickjs_set_property_ref(
            ctx, limits, "maxCsiBytes",
            JS_NewUint32(ctx,
                CONFIG_ESP32_MQUICKJS_WIFI_CSI_MAX_FRAME_BYTES)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, limits, "maxPoolCapacity",
            JS_NewUint32(ctx,
                CONFIG_ESP32_MQUICKJS_WIFI_CSI_POOL_CAPACITY)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, limits, "maxTotalPoolCapacity",
            JS_NewUint32(ctx,
                CONFIG_ESP32_MQUICKJS_WIFI_CSI_POOL_CAPACITY)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, limits, "maxPoolGenerations",
            JS_NewUint32(ctx, ESP32_MQUICKJS_WIFI_CSI_STORE_MAX_GENERATIONS)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, limits, "maxQueueCapacity",
            JS_NewUint32(ctx,
                CONFIG_ESP32_MQUICKJS_WIFI_CSI_POOL_CAPACITY)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, limits, "maxBatchFrames",
            JS_NewUint32(ctx,
                CONFIG_ESP32_MQUICKJS_WIFI_CSI_MAX_BATCH_FRAMES)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, limits, "scaleMinimum", he ? JS_NewUint32(ctx, 0U) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(
            ctx, limits, "scaleMaximum", he ? JS_NewUint32(ctx, 8U) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(
            ctx, limits, "shiftMinimum", he ? JS_NULL : JS_NewUint32(ctx, 0U)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, limits, "shiftMaximum", he ? JS_NULL : JS_NewUint32(ctx, 15U)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, supports, "fixedChannel",
            JS_NewBool(WIFI_CSI_PROMISCUOUS_SUPPORTED)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, supports, "promiscuous",
            JS_NewBool(WIFI_CSI_PROMISCUOUS_SUPPORTED)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, supports, "sourceMacFilter", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(
            ctx, supports, "destinationMacFilter", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(ctx, supports, "bssidFilter", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(ctx, supports, "frameTypeFilter", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(ctx, supports, "frameFilter", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(ctx, supports, "frameSubtypeFilter", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(
            ctx, supports, "rssiFilter", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(
            ctx, supports, "nativeDecimation", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(
            ctx, supports, "nativeRateLimit", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(
            ctx, supports, "vht",
            JS_NewBool(vht)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, supports, "he", JS_NewBool(he)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, supports, "heStbcSelection", JS_NewBool(he)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, supports, "captureConfigReadback", JS_NewBool(he)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, supports, "manualScaling", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(
            ctx, supports, "lltfBitMode",
            JS_NewBool(
                esp32_mquickjs_wifi_csi_target_supports_lltf_bit_mode())) ||
        !esp32_mquickjs_set_property_ref(
            ctx, supports, "layout", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "apiVersion", JS_NewString(ctx, "wifi-csi/1")) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "target", JS_NewString(ctx, CONFIG_IDF_TARGET)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "idfVersion",
            JS_NewString(ctx, esp_get_idf_version())) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "configSchema",
            JS_NewString(ctx,
                esp32_mquickjs_wifi_csi_target_schema_name())) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "sources", *sources) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "phyFormats", *formats) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "sampleEncodings", *encodings) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "limits", *limits) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "supports", *supports) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "radio", *radio) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "packetCapture", wifi_csi_packet_capabilities(ctx)))
        goto fail;
    *sources = JS_UNDEFINED;
    *formats = JS_UNDEFINED;
    *limits = JS_UNDEFINED;
    *supports = JS_UNDEFINED;
    *radio = JS_UNDEFINED;
    *encodings = JS_UNDEFINED;
    JS_PopGCRef(ctx, &encodings_ref);
    JS_PopGCRef(ctx, &radio_ref);
    JS_PopGCRef(ctx, &supports_ref);
    JS_PopGCRef(ctx, &limits_ref);
    JS_PopGCRef(ctx, &formats_ref);
    JS_PopGCRef(ctx, &sources_ref);
    return JS_PopGCRef(ctx, &result_ref);

