99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_csi/esp32_mquickjs_wifi_csi.c
fail:
    JS_PopGCRef(ctx, &encodings_ref);
    JS_PopGCRef(ctx, &radio_ref);
    JS_PopGCRef(ctx, &supports_ref);
    JS_PopGCRef(ctx, &limits_ref);
    JS_PopGCRef(ctx, &formats_ref);
    JS_PopGCRef(ctx, &sources_ref);
    JS_PopGCRef(ctx, &result_ref);
    return JS_EXCEPTION;
}

JSValue js_wifi_csi_open(JSContext *ctx, JSValue *this_val,
                         int argc, JSValue *argv)
{
    wifi_csi_options_t options;
    esp32_mquickjs_wifi_csi_allocator_t allocator;
    wifi_csi_session_ref_t *ref = NULL;
    JSGCRef queue_ref, object_ref;
    JSValue *queue = JS_PushGCRef(ctx, &queue_ref);
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    uint32_t generation;
    esp_err_t err;

    (void)this_val;
    *queue = JS_UNDEFINED;
    *object = JS_UNDEFINED;
    if (argc != 1) {
        JS_ThrowTypeError(ctx,
            "wifi.csi.open(options) expects one options object");
        goto fail;
    }
    if (!wifi_csi_parse_open_options(ctx, argv[0], &options)) goto fail;
    if (atomic_load_explicit(&s_wifi_csi.lifecycle,
                             memory_order_acquire) != WIFI_CSI_CLOSED) {
        JS_ThrowReferenceError(ctx,
            "WIFI_CSI_ALREADY_OPEN: a CSI session already exists");
        goto fail;
    }
    if (atomic_load_explicit(&s_wifi_csi.cleanup_scheduled,
                             memory_order_acquire)) {
        JS_ThrowReferenceError(ctx,
            "WIFI_CSI_CLEANUP_PENDING: native cleanup worker is still active");
        goto fail;
    }
    if (wifi_csi_pool_retirement_pending()) {
        JS_ThrowReferenceError(ctx,
            "WIFI_CSI_CLEANUP_PENDING: previous control has not detached its pool");
        goto fail;
    }
    allocator = wifi_csi_resource_allocator();
    esp32_mquickjs_wifi_csi_store_result_t allocation_result;
    esp32_mquickjs_wifi_csi_resources_t *resources = esp32_mquickjs_wifi_csi_store_open(
        &s_wifi_csi_store, options.pool_capacity, esp32_mquickjs_wifi_csi_packet_capacity(&options.packet),
        &allocator, &allocation_result);
    if (resources == NULL) {
        if (allocation_result == ESP32_MQUICKJS_WIFI_CSI_STORE_IDENTITY)
            JS_ThrowInternalError(ctx, "WIFI_CSI_IDENTITY_EXHAUSTED: device reboot required");
        else if (allocation_result == ESP32_MQUICKJS_WIFI_CSI_STORE_BUDGET)
            JS_ThrowInternalError(ctx, "WIFI_CSI_RESOURCE_EXHAUSTED: retained CSI pools exhaust the slot or generation budget");
        else JS_ThrowOutOfMemory(ctx);
        goto fail;
    }
    generation = resources->generation;
    memset(&s_wifi_csi, 0, sizeof(s_wifi_csi));
    s_wifi_csi.lock = (portMUX_TYPE)portMUX_INITIALIZER_UNLOCKED;
    atomic_init(&s_wifi_csi.lifecycle, WIFI_CSI_OPENING);
    atomic_init(&s_wifi_csi.cleanup_scheduled, false);
    atomic_init(&s_wifi_csi.close_requested, false);
    atomic_init(&s_wifi_csi.resources, resources);
    s_wifi_csi.generation = generation;
    s_wifi_csi.runtime = esp32_mquickjs_get_active_runtime();
    s_wifi_csi.options = options;
    resources->filter = options.filter;
    resources->packet_options = options.packet;
    *queue = esp32_mquickjs_event_queue_new_wireless("wifi.csi",
        ctx, s_wifi_csi.runtime,
        sizeof(esp32_mquickjs_wifi_csi_event_t), options.queue_capacity,
        ESP32_MQUICKJS_EVENT_QUEUE_DROP_NEWEST,
        wifi_csi_event_to_js, wifi_csi_event_drop,
        wifi_csi_event_queue_close, (void *)(uintptr_t)generation);
    if (JS_IsException(*queue)) goto fail_open;
    s_wifi_csi.event_queue = esp32_mquickjs_event_queue_from_value(ctx, *queue);
    if (s_wifi_csi.event_queue == NULL ||
        !esp32_mquickjs_event_queue_retain(s_wifi_csi.event_queue)) {
        JS_ThrowInternalError(ctx,
            "WIFI_CSI_RESOURCE_EXHAUSTED: failed to retain receive queue");
        goto fail_open;
    }
    s_wifi_csi.event_queue_retained = true;
    err = esp32_mquickjs_wifi_radio_acquire(
        ESP32_MQUICKJS_WIFI_RADIO_CLIENT_CSI, WIFI_MODE_STA,
        &s_wifi_csi.radio_lease);
    if (err != ESP_OK) {
        wifi_csi_throw_driver_error(ctx, "WIFI_CSI_RESOURCE_EXHAUSTED",
                                    "wifi_radio_acquire", err);
        goto fail_open;
    }
    err = wifi_csi_start_native(&s_wifi_csi);
    if (err != ESP_OK) {
        const char *code = wifi_csi_start_error_code(&s_wifi_csi, err);
        wifi_csi_throw_driver_error(
            ctx, code,
            s_wifi_csi.last_error_stage != NULL
                ? s_wifi_csi.last_error_stage : "start",
            err);
        goto fail_open;
    }
    *object = JS_NewObjectClassUser(ctx, JS_CLASS_WIFI_CSI_SESSION);
    if (JS_IsException(*object)) goto fail_open;
    ref = esp32_mquickjs_memory_wireless_calloc("wifi.csi", 1, sizeof(*ref), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (ref == NULL) {
        JS_ThrowOutOfMemory(ctx);
        goto fail_open;
    }
    ref->generation = generation;
    JS_SetOpaque(ctx, *object, ref);
    if (!esp32_mquickjs_set_property_ref(
            ctx, object, WIFI_CSI_EVENT_QUEUE_KEY, *queue)) {
        JS_SetOpaque(ctx, *object, NULL);
        esp32_mquickjs_memory_payload_free(ref);
        ref = NULL;
        goto fail_open;
    }
    *queue = JS_UNDEFINED;
    {
        JSValue return_value = JS_PopGCRef(ctx, &object_ref);
        JS_PopGCRef(ctx, &queue_ref);
        return return_value;
    }

fail_open:
    if (!wifi_csi_close_native(&s_wifi_csi)) {
        wifi_csi_request_reap(&s_wifi_csi);
    }
    if (!JS_IsUndefined(*queue) &&
        JS_GetClassID(ctx, *queue) == JS_CLASS_EVENT_QUEUE) {
        (void)esp32_mquickjs_event_queue_dispose(ctx, *queue);
    }
fail:
    JS_PopGCRef(ctx, &object_ref);
    JS_PopGCRef(ctx, &queue_ref);
    return JS_EXCEPTION;
}

static const char *wifi_csi_power_save_name(wifi_ps_type_t power_save)
{
    return power_save == WIFI_PS_NONE ? "none" :
           power_save == WIFI_PS_MIN_MODEM ? "minimum-modem" :
           power_save == WIFI_PS_MAX_MODEM ? "maximum-modem" : "unknown";
}

static JSValue wifi_csi_status_to_js(JSContext *ctx,
                                     wifi_csi_session_t *session)
{
    wifi_csi_refresh_channel(session);
    JSGCRef result_ref, requested_ref, effective_ref, error_ref;
    JSGCRef details_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *requested = JS_PushGCRef(ctx, &requested_ref);
    JSValue *effective = JS_PushGCRef(ctx, &effective_ref);
    JSValue *error = JS_PushGCRef(ctx, &error_ref);
    JSValue *details = JS_PushGCRef(ctx, &details_ref);
    wifi_csi_lifecycle_t lifecycle = atomic_load_explicit(
        &session->lifecycle, memory_order_acquire);

    *result = JS_NewObject(ctx);
    *requested = wifi_csi_requested_to_js(ctx, &session->options);
    *effective = JS_NewObject(ctx);
    *error = JS_NULL;
    *details = JS_UNDEFINED;
    if (session->last_error != ESP_OK) {
        *error = JS_NewObject(ctx);
        *details = JS_NewObject(ctx);
        if (JS_IsException(*error) || JS_IsException(*details) ||
            !esp32_mquickjs_set_property_ref(
                ctx, details, "stage",
                session->last_error_stage != NULL
                    ? JS_NewString(ctx, session->last_error_stage) : JS_NULL) ||
            !esp32_mquickjs_set_property_ref(
                ctx, details, "espCode",
                JS_NewInt32(ctx, session->last_error)) ||
            !esp32_mquickjs_set_property_ref(
                ctx, details, "espName",
                JS_NewString(ctx, esp_err_to_name(session->last_error))) ||
            !esp32_mquickjs_set_property_ref(
                ctx, error, "code",
                JS_NewString(ctx, session->last_error_code != NULL
                    ? session->last_error_code : "WIFI_CSI_DRIVER_ERROR")) ||
            !esp32_mquickjs_set_property_ref(
                ctx, error, "operation", JS_NewString(ctx, "wifi.csi")) ||
            !esp32_mquickjs_set_property_ref(
                ctx, error, "message",
                JS_NewString(ctx, "Wi-Fi CSI operation failed")) ||
            !esp32_mquickjs_set_property_ref(
                ctx, error, "details", *details)) goto fail;
        *details = JS_UNDEFINED;
    }
    if (JS_IsException(*result) || JS_IsException(*requested) ||
        JS_IsException(*effective) || JS_IsException(*error) ||
        !esp32_mquickjs_set_property_ref(
            ctx, effective, "source",
            JS_NewString(ctx, wifi_csi_source_name(session->options.source))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, effective, "channel",
            JS_NewUint32(ctx, session->effective_channel)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, effective, "secondaryChannel",
            JS_NewString(ctx,
                wifi_csi_wifi_secondary_name(session->effective_secondary))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, effective, "radioGeneration",
            JS_NewUint32(ctx, session->radio_generation)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, effective, "configSchema",
            JS_NewString(ctx,
                esp32_mquickjs_wifi_csi_target_schema_name())) ||
        !esp32_mquickjs_set_property_ref(
            ctx, effective, "maxCsiBytes",
            JS_NewUint32(ctx,
                CONFIG_ESP32_MQUICKJS_WIFI_CSI_MAX_FRAME_BYTES)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, effective, "queueCapacity",
            JS_NewUint32(ctx, session->options.queue_capacity)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, effective, "poolCapacity",
            JS_NewUint32(ctx, session->options.pool_capacity)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, effective, "powerSave",
            JS_NewString(ctx,
                wifi_csi_power_save_name(session->effective_power_save))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, effective, "timestampAccuracy",
            JS_NewString(ctx, "callback-time")) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "generation",
            JS_NewUint32(ctx, session->generation)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "state",
            JS_NewString(ctx, wifi_csi_lifecycle_name(lifecycle))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "requested", *requested) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "effective", *effective) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "lastError", *error))
        goto fail;
    *requested = JS_UNDEFINED;
    *effective = JS_UNDEFINED;
    *error = JS_UNDEFINED;
    JS_PopGCRef(ctx, &details_ref);
    JS_PopGCRef(ctx, &error_ref);
    JS_PopGCRef(ctx, &effective_ref);
    JS_PopGCRef(ctx, &requested_ref);
    return JS_PopGCRef(ctx, &result_ref);

