99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_csi/esp32_mquickjs_wifi_csi.c
fail:
    JS_PopGCRef(ctx, &details_ref);
    JS_PopGCRef(ctx, &error_ref);
    JS_PopGCRef(ctx, &effective_ref);
    JS_PopGCRef(ctx, &requested_ref);
    JS_PopGCRef(ctx, &result_ref);
    return JS_EXCEPTION;
}

static const char *wifi_csi_store_state_name(esp32_mquickjs_wifi_csi_store_state_t state)
{
    switch (state) {
        case ESP32_MQUICKJS_WIFI_CSI_STORE_ALLOCATING: return "allocating";
        case ESP32_MQUICKJS_WIFI_CSI_STORE_ACTIVE: return "active";
        case ESP32_MQUICKJS_WIFI_CSI_STORE_RETAINED: return "retained";
        case ESP32_MQUICKJS_WIFI_CSI_STORE_RETIRING: return "retiring";
        default: return "none";
    }
}

uint32_t esp32_mquickjs_wifi_csi_reset_counters(void)
{
    return esp32_mquickjs_wifi_csi_store_reset_counters(&s_wifi_csi_store);
}

JSValue esp32_mquickjs_wifi_csi_diagnostics(JSContext *ctx)
{
    esp32_mquickjs_wifi_csi_store_snapshot_t entries[ESP32_MQUICKJS_WIFI_CSI_STORE_MAX_GENERATIONS];
    size_t count = esp32_mquickjs_wifi_csi_store_snapshot(&s_wifi_csi_store, entries);
    uint32_t generation = s_wifi_csi.generation;
    wifi_csi_lifecycle_t lifecycle = atomic_load_explicit(&s_wifi_csi.lifecycle, memory_order_acquire);
    bool cleanup = atomic_load_explicit(&s_wifi_csi.cleanup_scheduled, memory_order_acquire);
    bool closing = atomic_load_explicit(&s_wifi_csi.close_requested, memory_order_acquire);
    bool identity_exhausted = atomic_load_explicit(&s_wifi_csi_store.next_generation, memory_order_acquire) == 0;
    uint64_t active_bytes = 0, retained_bytes = 0, pending_bytes = 0;
    uint32_t reserved_slots = 0;
    /* Each entry is a pointer-free native copy before the first JS allocation.
     * Storage bytes include its resource control, slots and sample allocation;
     * neither queue/JS/allocator overhead nor a global wireless budget is implied. */
    JSGCRef result_ref, array_ref, item_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *array = JS_PushGCRef(ctx, &array_ref);
    JSValue *item = JS_PushGCRef(ctx, &item_ref);
    *result = JS_NewObject(ctx);
    *array = JS_NewArray(ctx, 0);
    *item = JS_UNDEFINED;
    if (JS_IsException(*result) || JS_IsException(*array)) goto fail;
#define CSI_DIAG_SET(owner, name, value) do { if (!esp32_mquickjs_set_property_ref(ctx, owner, name, value)) goto fail; } while (0)
#define CSI_DIAG_NUMBER(owner, name, value) CSI_DIAG_SET(owner, name, JS_NewFloat64(ctx, (double)(value)))
    for (size_t i = 0; i < count; ++i) {
        const esp32_mquickjs_wifi_csi_store_snapshot_t *entry = &entries[i];
        bool readable = entry->state == ESP32_MQUICKJS_WIFI_CSI_STORE_ACTIVE ||
            entry->state == ESP32_MQUICKJS_WIFI_CSI_STORE_RETAINED;
        reserved_slots += entry->capacity;
        if (entry->state == ESP32_MQUICKJS_WIFI_CSI_STORE_ACTIVE) active_bytes += entry->bytes;
        else if (entry->state == ESP32_MQUICKJS_WIFI_CSI_STORE_RETAINED) retained_bytes += entry->bytes;
        else pending_bytes += entry->bytes;
        *item = JS_NewObject(ctx);
        if (JS_IsException(*item)) goto fail;
        CSI_DIAG_NUMBER(item, "generation", entry->generation);
        CSI_DIAG_SET(item, "state", JS_NewString(ctx, wifi_csi_store_state_name(entry->state)));
        CSI_DIAG_NUMBER(item, "capacity", entry->capacity);
        CSI_DIAG_NUMBER(item, "storageBytes", entry->bytes);
        CSI_DIAG_SET(item, "freeSlots", readable ? JS_NewUint32(ctx, entry->free_slots) : JS_NULL);
        CSI_DIAG_SET(item, "identityExhausted", readable ? JS_NewBool(entry->identity_exhausted) : JS_NULL);
        CSI_DIAG_SET(item, "droppedIdentityExhausted", readable ? JS_NewUint32(ctx, entry->dropped_identity_exhausted) : JS_NULL);
        CSI_DIAG_SET(item, "leasedFrames", readable ? JS_NewUint32(ctx, entry->leased_frames) : JS_NULL);
        CSI_DIAG_SET(item, "callbacks", readable ? JS_NewUint32(ctx, entry->callbacks) : JS_NULL);
        CSI_DIAG_SET(item, "accepted", readable ? JS_NewUint32(ctx, entry->accepted) : JS_NULL);
        CSI_DIAG_SET(item, "droppedPoolFull", readable ? JS_NewUint32(ctx, entry->dropped_pool_full) : JS_NULL);
        CSI_DIAG_SET(item, "droppedQueueFull", readable ? JS_NewUint32(ctx, entry->dropped_queue_full) : JS_NULL);
        CSI_DIAG_SET(item, "droppedClosing", readable ? JS_NewUint32(ctx, entry->dropped_closing) : JS_NULL);
        if (JS_IsException(JS_SetPropertyUint32(ctx, *array, (uint32_t)i, *item))) goto fail;
        *item = JS_UNDEFINED;
    }
    CSI_DIAG_NUMBER(result, "generation", generation);
    CSI_DIAG_SET(result, "state", JS_NewString(ctx, wifi_csi_lifecycle_name(lifecycle)));
    CSI_DIAG_NUMBER(result, "controlBytes", sizeof(s_wifi_csi) + sizeof(s_wifi_csi_store) + sizeof(s_wifi_csi_store_lock) + esp32_mquickjs_wifi_csi_rx_native_control_bytes());
    CSI_DIAG_NUMBER(result, "slotBudget", s_wifi_csi_store.maximum_slots);
    CSI_DIAG_NUMBER(result, "generationBudget", ESP32_MQUICKJS_WIFI_CSI_STORE_MAX_GENERATIONS);
    CSI_DIAG_NUMBER(result, "reservedSlots", reserved_slots);
    CSI_DIAG_NUMBER(result, "storageBytes", active_bytes + retained_bytes + pending_bytes);
    CSI_DIAG_NUMBER(result, "activeStorageBytes", active_bytes);
    CSI_DIAG_NUMBER(result, "retainedStorageBytes", retained_bytes);
    CSI_DIAG_NUMBER(result, "pendingStorageBytes", pending_bytes);
    CSI_DIAG_SET(result, "identityExhausted", JS_NewBool(identity_exhausted));
    CSI_DIAG_SET(result, "generations", *array);
    CSI_DIAG_SET(result, "cleanupScheduled", JS_NewBool(cleanup));
    CSI_DIAG_SET(result, "closeRequested", JS_NewBool(closing));
#undef CSI_DIAG_NUMBER
#undef CSI_DIAG_SET
    JS_PopGCRef(ctx, &item_ref);
    JS_PopGCRef(ctx, &array_ref);
    return JS_PopGCRef(ctx, &result_ref);
fail:
    JS_PopGCRef(ctx, &item_ref);
    JS_PopGCRef(ctx, &array_ref);
    JS_PopGCRef(ctx, &result_ref);
    return JS_EXCEPTION;
}

JSValue js_wifi_csi_session_status(JSContext *ctx, JSValue *this_val,
                                   int argc, JSValue *argv)
{
    wifi_csi_session_t *session;

    (void)argv;
    if (argc != 0 || this_val == NULL ||
        (session = wifi_csi_session_from_value(
            ctx, *this_val, true)) == NULL) {
        if (!JS_HasException(ctx)) {
            return JS_ThrowTypeError(
                ctx, "WiFiCsiSession.status() expects no arguments");
        }
        return JS_EXCEPTION;
    }
    return wifi_csi_status_to_js(ctx, session);
}

