99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_csi/esp32_mquickjs_wifi_csi.c
/* Convert a native observation, independently of requested Session options.
 * Preserve otherwise inactive shift/enable bits too; no input validation may
 * silently normalize a driver readback into the requested configuration. */
static JSValue wifi_csi_native_config_to_js(JSContext *ctx,
    const wifi_csi_config_t *native, uint32_t generation)
{
#if CONFIG_SOC_WIFI_HE_SUPPORT
    unsigned stbc =
#if CONFIG_SOC_WIFI_MAC_VERSION_NUM == 3
        native->acquire_csi_he_stbc_mode;
#else
        native->acquire_csi_he_stbc;
#endif
    if (stbc > ESP32_MQUICKJS_WIFI_CSI_HE_STBC_ALTERNATE)
        return wifi_csi_throw_driver_error(ctx, "WIFI_CSI_DRIVER_ERROR", "csi-config-decode", ESP_ERR_INVALID_RESPONSE);
    JSGCRef result_ref, capture_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *capture = JS_PushGCRef(ctx, &capture_ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    *capture = JS_NewObject(ctx);
    if (JS_IsException(*capture)) goto fail;
#define SET(object, name, value) do { \
    if (!esp32_mquickjs_set_property_ref(ctx, object, name, value)) goto fail; \
} while (0)
    SET(result, "radioGeneration", JS_NewUint32(ctx, generation));
    SET(capture, "schema", JS_NewString(ctx, "wifi-csi-he/1"));
    SET(capture, "enable", JS_NewBool(native->enable));
    SET(capture, "enableLegacy", JS_NewBool(native->acquire_csi_legacy));
#if CONFIG_SOC_WIFI_MAC_VERSION_NUM == 3
    SET(capture, "forceLegacyLtf", JS_NewBool(native->acquire_csi_force_lltf));
    SET(capture, "vht", JS_NewBool(native->acquire_csi_vht));
    SET(capture, "lltfBits", JS_NewUint32(ctx, native->lltf_bit_mode ? 8 : 12));
#else
    SET(capture, "forceLegacyLtf", JS_FALSE);
    SET(capture, "vht", JS_FALSE);
    SET(capture, "lltfBits", JS_NewUint32(ctx, 8));
#endif
    SET(capture, "ht20", JS_NewBool(native->acquire_csi_ht20));
    SET(capture, "ht40", JS_NewBool(native->acquire_csi_ht40));
    SET(capture, "heSu", JS_NewBool(native->acquire_csi_su));
    SET(capture, "heMu", JS_NewBool(native->acquire_csi_mu));
    SET(capture, "heDcm", JS_NewBool(native->acquire_csi_dcm));
    SET(capture, "heBeamformed", JS_NewBool(native->acquire_csi_beamformed));
    SET(capture, "heStbcLtf", JS_NewString(ctx, stbc == 0 ? "first" : stbc == 1 ? "second" : "alternate"));
    SET(capture, "valueScale", JS_NewUint32(ctx, native->val_scale_cfg));
    SET(capture, "dumpAck", JS_NewBool(native->dump_ack_en));
    SET(result, "capture", *capture);
#undef SET
    JS_PopGCRef(ctx, &capture_ref);
    return JS_PopGCRef(ctx, &result_ref);
fail:
    JS_PopGCRef(ctx, &capture_ref);
    JS_PopGCRef(ctx, &result_ref);
    return JS_EXCEPTION;
#else
    (void)native; (void)generation;
    return wifi_csi_throw_driver_error(ctx, "WIFI_CSI_DRIVER_ERROR", "csi-config-read", ESP_ERR_NOT_SUPPORTED);
#endif
}

JSValue js_wifi_csi_session_get_capture_config(JSContext *ctx, JSValue *this_val,
                                               int argc, JSValue *argv)
{
    (void)argv;
    if (argc != 0 || this_val == NULL)
        return JS_ThrowTypeError(ctx, "WiFiCsiSession.getCaptureConfig() expects no arguments");
    wifi_csi_session_t *session = wifi_csi_session_from_value(ctx, *this_val, false);
    if (session == NULL) return JS_EXCEPTION;
    wifi_csi_config_t native;
    uint32_t generation;
    esp_err_t error = esp32_mquickjs_wifi_radio_read_csi_config(&session->radio_lease, &native, &generation);
    if (error != ESP_OK)
        return wifi_csi_throw_driver_error(ctx, "WIFI_CSI_DRIVER_ERROR", "csi-config-read", error);
    /* Only copied scalars survive any allocation/GC below. */
    return wifi_csi_native_config_to_js(ctx, &native, generation);
}

JSValue js_wifi_csi_session_stats(JSContext *ctx, JSValue *this_val,
                                  int argc, JSValue *argv)
{
    wifi_csi_session_t *session;
    wifi_csi_stats_snapshot_t snapshot;
    esp32_mquickjs_event_queue_stats_t queue_stats = {0};
    JSGCRef result_ref, queue_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *queue = JS_PushGCRef(ctx, &queue_ref);
    uint32_t free_slots = 0U;

    (void)argv;
    *result = JS_UNDEFINED;
    *queue = JS_UNDEFINED;
    if (argc != 0 || this_val == NULL ||
        (session = wifi_csi_session_from_value(
            ctx, *this_val, true)) == NULL) goto fail;
    taskENTER_CRITICAL(&session->lock);
    snapshot = session->final_stats;
    taskEXIT_CRITICAL(&session->lock);
    esp32_mquickjs_wifi_csi_resources_t *resources = esp32_mquickjs_wifi_csi_store_acquire(
        &s_wifi_csi_store, session->generation);
    if (resources != NULL) {
#define WIFI_CSI_STATS_COPY(name) snapshot.name = atomic_load_explicit(&resources->counters.name, memory_order_acquire)
        WIFI_CSI_STATS_COPY(callbacks);
        WIFI_CSI_STATS_COPY(accepted);
        WIFI_CSI_STATS_COPY(delivered_frames);
        WIFI_CSI_STATS_COPY(delivered_batches);
        WIFI_CSI_STATS_COPY(filtered_mac);
        WIFI_CSI_STATS_COPY(filtered_bssid);
        WIFI_CSI_STATS_COPY(filtered_frame_type);
        WIFI_CSI_STATS_COPY(filtered_frame_subtype);
        WIFI_CSI_STATS_COPY(dropped_identity_exhausted);
        WIFI_CSI_STATS_COPY(filtered_rssi);
        WIFI_CSI_STATS_COPY(filtered_decimation);
        WIFI_CSI_STATS_COPY(filtered_rate_limit);
        WIFI_CSI_STATS_COPY(filtered_first_word_invalid);
        WIFI_CSI_STATS_COPY(filtered_channel_estimate_invalid);
        WIFI_CSI_STATS_COPY(invalid_callback_data);
        WIFI_CSI_STATS_COPY(dropped_pool_full);
        WIFI_CSI_STATS_COPY(dropped_queue_full);
        WIFI_CSI_STATS_COPY(dropped_frame_too_large);
        WIFI_CSI_STATS_COPY(dropped_closing);
        WIFI_CSI_STATS_COPY(received_bytes);
        WIFI_CSI_STATS_COPY(packet_unavailable);
        WIFI_CSI_STATS_COPY(packet_malformed);
        WIFI_CSI_STATS_COPY(packet_truncated);
        WIFI_CSI_STATS_COPY(dropped_packet_required);
        WIFI_CSI_STATS_COPY(dropped_packet_incomplete);
        WIFI_CSI_STATS_COPY(received_packet_bytes);
        WIFI_CSI_STATS_COPY(leased_frames);
#undef WIFI_CSI_STATS_COPY
        free_slots = esp32_mquickjs_native_pool_available(&resources->pool);
        esp32_mquickjs_wifi_csi_store_release(&s_wifi_csi_store, resources);
    } else {
        snapshot.leased_frames = 0;
    }
    if (session->event_queue != NULL) {
        (void)esp32_mquickjs_event_queue_get_stats(
            session->event_queue, &queue_stats);
    }
    *result = JS_NewObject(ctx);
    *queue = JS_NewObject(ctx);
#define WIFI_CSI_COUNTER(name) snapshot.name
    if (JS_IsException(*result) || JS_IsException(*queue) ||
        !esp32_mquickjs_set_property_ref(
            ctx, queue, "open", JS_NewBool(queue_stats.open)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, queue, "queued", JS_NewUint32(ctx, queue_stats.queued)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, queue, "capacity", JS_NewUint32(ctx, queue_stats.capacity)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, queue, "dropped", JS_NewUint32(ctx, queue_stats.dropped)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, queue, "highWater", JS_NewUint32(ctx, queue_stats.high_water)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, queue, "receiverPending",
            JS_NewBool(queue_stats.receiver_pending)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "callbacks",
            JS_NewUint32(ctx, WIFI_CSI_COUNTER(callbacks))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "accepted",
            JS_NewUint32(ctx, WIFI_CSI_COUNTER(accepted))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "deliveredFrames",
            JS_NewUint32(ctx, WIFI_CSI_COUNTER(delivered_frames))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "deliveredBatches",
            JS_NewUint32(ctx, WIFI_CSI_COUNTER(delivered_batches))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "filteredMac",
            JS_NewUint32(ctx, WIFI_CSI_COUNTER(filtered_mac))) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "filteredBssid", JS_NewUint32(ctx, WIFI_CSI_COUNTER(filtered_bssid))) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "filteredFrameType", JS_NewUint32(ctx, WIFI_CSI_COUNTER(filtered_frame_type))) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "filteredFrameSubtype", JS_NewUint32(ctx, WIFI_CSI_COUNTER(filtered_frame_subtype))) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "droppedIdentityExhausted", JS_NewUint32(ctx, WIFI_CSI_COUNTER(dropped_identity_exhausted))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "filteredRssi",
            JS_NewUint32(ctx, WIFI_CSI_COUNTER(filtered_rssi))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "filteredDecimation",
            JS_NewUint32(ctx, WIFI_CSI_COUNTER(filtered_decimation))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "filteredRateLimit",
            JS_NewUint32(ctx, WIFI_CSI_COUNTER(filtered_rate_limit))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "filteredFirstWordInvalid",
            JS_NewUint32(ctx,
                WIFI_CSI_COUNTER(filtered_first_word_invalid))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "filteredChannelEstimateInvalid",
            JS_NewUint32(ctx,
                WIFI_CSI_COUNTER(filtered_channel_estimate_invalid))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "invalidCallbackData",
            JS_NewUint32(ctx,
                WIFI_CSI_COUNTER(invalid_callback_data))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "droppedPoolFull",
            JS_NewUint32(ctx, WIFI_CSI_COUNTER(dropped_pool_full))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "droppedQueueFull",
            JS_NewUint32(ctx, WIFI_CSI_COUNTER(dropped_queue_full))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "droppedFrameTooLarge",
            JS_NewUint32(ctx,
                WIFI_CSI_COUNTER(dropped_frame_too_large))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "droppedClosing",
            JS_NewUint32(ctx, WIFI_CSI_COUNTER(dropped_closing))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "receivedBytes",
            JS_NewUint32(ctx, WIFI_CSI_COUNTER(received_bytes))) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "packetUnavailable",
            JS_NewUint32(ctx, WIFI_CSI_COUNTER(packet_unavailable))) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "packetMalformed",
            JS_NewUint32(ctx, WIFI_CSI_COUNTER(packet_malformed))) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "packetTruncated",
            JS_NewUint32(ctx, WIFI_CSI_COUNTER(packet_truncated))) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "droppedPacketRequired",
            JS_NewUint32(ctx, WIFI_CSI_COUNTER(dropped_packet_required))) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "droppedPacketIncomplete",
            JS_NewUint32(ctx, WIFI_CSI_COUNTER(dropped_packet_incomplete))) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "receivedPacketBytes",
            JS_NewUint32(ctx, WIFI_CSI_COUNTER(received_packet_bytes))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "leasedFrames",
            JS_NewUint32(ctx, WIFI_CSI_COUNTER(leased_frames))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "freePoolSlots", JS_NewUint32(ctx, free_slots)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "queue", *queue)) {
#undef WIFI_CSI_COUNTER
        goto fail;
    }
#undef WIFI_CSI_COUNTER
    *queue = JS_UNDEFINED;
    JS_PopGCRef(ctx, &queue_ref);
    return JS_PopGCRef(ctx, &result_ref);

