99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_csi/esp32_mquickjs_wifi_csi.c
fail:
    JS_PopGCRef(ctx, &queue_ref);
    JS_PopGCRef(ctx, &result_ref);
    return JS_EXCEPTION;
}

JSValue js_wifi_csi_session_receive(JSContext *ctx, JSValue *this_val,
                                    int argc, JSValue *argv)
{
    JSGCRef method_ref;
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    JSValue result;

    if (this_val == NULL || wifi_csi_session_from_value(
            ctx, *this_val, false) == NULL ||
        atomic_load_explicit(&s_wifi_csi.lifecycle,
                             memory_order_acquire) != WIFI_CSI_RUNNING) {
        JS_PopGCRef(ctx, &method_ref);
        if (!JS_HasException(ctx)) {
            return JS_ThrowReferenceError(
                ctx, "WIFI_CSI_NOT_RUNNING: receive requires a running session");
        }
        return JS_EXCEPTION;
    }
    *method = JS_GetPropertyStr(ctx, *this_val, "receive");
    result = JS_IsException(*method)
        ? JS_EXCEPTION
        : esp32_mquickjs_future_call_and_wait(
            ctx, esp32_mquickjs_get_active_runtime(), *method,
            *this_val, argc, argv);
    JS_PopGCRef(ctx, &method_ref);
    return result;
}

JSValue js_wifi_csi_session_stop(JSContext *ctx, JSValue *this_val,
                                 int argc, JSValue *argv)
{
    wifi_csi_session_t *session;
    esp_err_t err;

    (void)argv;
    if (argc != 0 || this_val == NULL ||
        (session = wifi_csi_session_from_value(
            ctx, *this_val, false)) == NULL) {
        if (!JS_HasException(ctx)) {
            return JS_ThrowTypeError(
                ctx, "WiFiCsiSession.stop() expects no arguments");
        }
        return JS_EXCEPTION;
    }
    err = wifi_csi_stop_native(session);
    if (err != ESP_OK) {
        return wifi_csi_throw_driver_error(ctx, "WIFI_CSI_DRIVER_ERROR",
                                           "stop", err);
    }
    return wifi_csi_status_to_js(ctx, session);
}

JSValue js_wifi_csi_session_configure(JSContext *ctx, JSValue *this_val,
                                      int argc, JSValue *argv)
{
    wifi_csi_session_t *session;
    wifi_csi_options_t options;

    if (argc != 1 || this_val == NULL ||
        (session = wifi_csi_session_from_value(
            ctx, *this_val, false)) == NULL) {
        if (!JS_HasException(ctx)) {
            return JS_ThrowTypeError(
                ctx, "WiFiCsiSession.configure(options) expects one argument");
        }
        return JS_EXCEPTION;
    }
    if (atomic_load_explicit(&session->resources->identity_exhausted, memory_order_acquire)) {
        return wifi_csi_throw_driver_error(ctx, "WIFI_CSI_IDENTITY_EXHAUSTED",
            "capture-identity", ESP_ERR_INVALID_STATE);
    }

    if (atomic_load_explicit(&session->lifecycle,
                             memory_order_acquire) != WIFI_CSI_STOPPED) {
        return JS_ThrowReferenceError(ctx,
            "WIFI_CSI_NOT_RUNNING: configure requires stopped state");
    }
    if (!wifi_csi_parse_open_options(ctx, argv[0], &options)) {
        return JS_EXCEPTION;
    }
    if (options.queue_capacity != session->options.queue_capacity ||
        options.pool_capacity != session->options.pool_capacity) {
        return JS_ThrowTypeError(ctx,
            "WIFI_CSI_CONFIG_UNSUPPORTED: buffering capacities cannot change within a session");
    }
    if (esp32_mquickjs_wifi_csi_packet_capacity(&options.packet) > session->resources->max_packet_bytes) {
        return JS_ThrowRangeError(ctx, "WIFI_CSI_CONFIG_UNSUPPORTED: packet capacity exceeds the allocation made at open");
    }
    atomic_store_explicit(&session->channel_conflicted, false, memory_order_release);
    session->options = options;
    session->resources->packet_options = options.packet;
    session->resources->filter = options.filter;
    session->resources->filter_phase = 0U;
    session->resources->last_accepted_timestamp_set = false;
    session->last_error = ESP_OK;
    session->last_error_code = NULL;
    session->last_error_stage = NULL;
    return wifi_csi_status_to_js(ctx, session);
}

JSValue js_wifi_csi_session_start(JSContext *ctx, JSValue *this_val,
                                  int argc, JSValue *argv)
{
    wifi_csi_session_t *session;
    esp_err_t err;

    (void)argv;
    if (argc != 0 || this_val == NULL ||
        (session = wifi_csi_session_from_value(
            ctx, *this_val, false)) == NULL) {
        if (!JS_HasException(ctx)) {
            return JS_ThrowTypeError(
                ctx, "WiFiCsiSession.start() expects no arguments");
        }
        return JS_EXCEPTION;
    }
    if (atomic_load_explicit(&session->resources->identity_exhausted, memory_order_acquire)) {
        return wifi_csi_throw_driver_error(ctx, "WIFI_CSI_IDENTITY_EXHAUSTED",
            "capture-identity", ESP_ERR_INVALID_STATE);
    }

    if (atomic_load_explicit(&session->lifecycle,
                             memory_order_acquire) == WIFI_CSI_RUNNING) {
        return wifi_csi_status_to_js(ctx, session);
    }
    if (atomic_load_explicit(&session->lifecycle,
                             memory_order_acquire) != WIFI_CSI_STOPPED) {
        return JS_ThrowReferenceError(ctx,
            "WIFI_CSI_CLOSING: start requires stopped state");
    }
    err = wifi_csi_start_native(session);
    if (err != ESP_OK) {
        atomic_store(&session->lifecycle, WIFI_CSI_FAULTED);
        return wifi_csi_throw_driver_error(
            ctx, wifi_csi_start_error_code(session, err),
            session->last_error_stage != NULL
                ? session->last_error_stage : "start", err);
    }
    return wifi_csi_status_to_js(ctx, session);
}

JSValue js_wifi_csi_session_close(JSContext *ctx, JSValue *this_val,
                                  int argc, JSValue *argv)
{
    wifi_csi_session_ref_t *ref;
    JSGCRef queue_ref;
    JSValue *queue = JS_PushGCRef(ctx, &queue_ref);

    (void)argv;
    *queue = JS_UNDEFINED;
    if (argc != 0 || this_val == NULL ||
        JS_GetClassID(ctx, *this_val) != JS_CLASS_WIFI_CSI_SESSION ||
        (ref = JS_GetOpaque(ctx, *this_val)) == NULL) {
        JS_PopGCRef(ctx, &queue_ref);
        return JS_ThrowTypeError(
            ctx, "WiFiCsiSession.close() expects no arguments");
    }
    if (ref->generation != s_wifi_csi.generation ||
        atomic_load(&s_wifi_csi.lifecycle) == WIFI_CSI_CLOSED) {
        JS_PopGCRef(ctx, &queue_ref);
        return JS_TRUE;
    }
    *queue = JS_GetPropertyStr(ctx, *this_val, WIFI_CSI_EVENT_QUEUE_KEY);
    bool closed = wifi_csi_close_native(&s_wifi_csi);
    if (!JS_IsException(*queue) &&
        JS_GetClassID(ctx, *queue) == JS_CLASS_EVENT_QUEUE) {
        (void)esp32_mquickjs_event_queue_dispose(ctx, *queue);
    }
    (void)JS_SetPropertyStr(ctx, *this_val, WIFI_CSI_EVENT_QUEUE_KEY,
                            JS_UNDEFINED);
    if (!closed) wifi_csi_request_reap(&s_wifi_csi);
    JS_PopGCRef(ctx, &queue_ref);
    return JS_NewBool(closed);
}

JSValue js_wifi_csi_session_constructor(JSContext *ctx, JSValue *this_val,
                                        int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(ctx,
        "WiFiCsiSession cannot be constructed directly");
}

