99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_csi/esp32_mquickjs_wifi_csi.c
void js_wifi_csi_session_finalizer(JSContext *ctx, void *opaque)
{
    wifi_csi_session_ref_t *ref = opaque;

    (void)ctx;
    if (ref != NULL && ref->generation == s_wifi_csi.generation) {
        wifi_csi_request_reap(&s_wifi_csi);
    }
    esp32_mquickjs_memory_payload_free(ref);
}

JSValue js_wifi_csi_frame_constructor(JSContext *ctx, JSValue *this_val,
                                      int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(ctx,
        "WiFiCsiFrame cannot be constructed directly");
}

void js_wifi_csi_frame_finalizer(JSContext *ctx, void *opaque)
{
    wifi_csi_frame_ref_t *ref = opaque;

    (void)ctx;
    if (ref != NULL && !ref->closed) {
        wifi_csi_lease_ref_t lease = {
            .event = {
                .session_generation = ref->session_generation,
                .slot_index = ref->slot_index,
                .slot_generation = ref->slot_generation,
            },
        };
        wifi_csi_lease_request_close(&lease);
    }
    esp32_mquickjs_memory_payload_free(ref);
}

static JSValue wifi_csi_frame_bytes(JSContext *ctx, JSValue *this_val,
    int argc, bool packet, bool copy)
{
    esp32_mquickjs_wifi_csi_event_t event;
    esp32_mquickjs_wifi_csi_slot_t *slot;
    if (argc != 0 || this_val == NULL)
        return JS_ThrowTypeError(ctx, "CSI frame byte methods require their Frame and no arguments");
    slot = wifi_csi_frame_from_value(ctx, *this_val, "WiFiCsiFrame bytes", NULL, &event);
    if (slot == NULL) return JS_EXCEPTION;
    if (packet && (slot->packet == NULL || slot->packet->length == 0)) return JS_NULL;
    uint8_t *bytes = packet ? slot->packet->bytes : slot->payload;
    size_t length = packet ? slot->packet->length : slot->length;
    if (copy) {
        uint8_t *owned = length != 0 ? esp32_mquickjs_memory_wireless_alloc("wifi.csi", length, ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_COPY) : NULL;
        if (length != 0 && owned == NULL) return JS_ThrowOutOfMemory(ctx);
        if (length != 0) memcpy(owned, bytes, length);
        return esp32_mquickjs_new_wireless_owned_byte_view("wifi.csi", ctx, owned, length);
    }
    wifi_csi_lease_ref_t *lease = wifi_csi_retain_event(&event);
    if (lease == NULL) return JS_ThrowOutOfMemory(ctx);
    return esp32_mquickjs_new_wireless_retained_byte_view("wifi.csi", ctx, bytes, length, wifi_csi_byte_view_release, lease);
}

JSValue js_wifi_csi_frame_samples(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{ (void)argv; return wifi_csi_frame_bytes(ctx, this_val, argc, false, false); }
JSValue js_wifi_csi_frame_copy_samples(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{ (void)argv; return wifi_csi_frame_bytes(ctx, this_val, argc, false, true); }
JSValue js_wifi_csi_frame_packet_bytes(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{ (void)argv; return wifi_csi_frame_bytes(ctx, this_val, argc, true, false); }
JSValue js_wifi_csi_frame_copy_packet_bytes(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{ (void)argv; return wifi_csi_frame_bytes(ctx, this_val, argc, true, true); }


static JSValue wifi_csi_frame_data_source(JSContext *ctx, JSValue *this_val,
                                 int argc, JSValue *argv, bool packet)
{
    esp32_mquickjs_wifi_csi_event_t event;
    esp32_mquickjs_wifi_csi_slot_t *slot;
    wifi_csi_sample_source_t *source;

    (void)argv;
    if (argc != 0 || this_val == NULL ||
        (slot = wifi_csi_frame_from_value(
            ctx, *this_val, "WiFiCsiFrame.sampleSource()", NULL, &event)) == NULL) {
        if (!JS_HasException(ctx)) {
            return JS_ThrowTypeError(
                ctx, "WiFiCsiFrame.sampleSource() expects no arguments");
        }
        return JS_EXCEPTION;
    }
    if (packet && (slot->packet == NULL || slot->packet->length == 0)) return JS_NULL;
    if (!wifi_csi_update_event(&event, WIFI_CSI_EVENT_RETAIN)) {
        return JS_ThrowReferenceError(
            ctx, "WIFI_CSI_STALE_FRAME: could not retain frame source");
    }
    source = esp32_mquickjs_memory_wireless_calloc("wifi.csi", 1, sizeof(*source), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (source == NULL) {
        (void)wifi_csi_update_event(&event, WIFI_CSI_EVENT_RELEASE);
        return JS_ThrowOutOfMemory(ctx);
    }
    source->lease.event = event;
    source->packet = packet;
    return esp32_mquickjs_new_wireless_byte_span_source("wifi.csi",
        ctx, JS_UNDEFINED, &s_wifi_csi_sample_source_ops, source);
}

JSValue js_wifi_csi_frame_sample_source(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{ return wifi_csi_frame_data_source(ctx, this_val, argc, argv, false); }
JSValue js_wifi_csi_frame_packet_source(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{ return wifi_csi_frame_data_source(ctx, this_val, argc, argv, true); }

JSValue js_wifi_csi_frame_source(JSContext *ctx, JSValue *this_val,
                                 int argc, JSValue *argv)
{
    if (this_val == NULL || JS_GetClassID(ctx, *this_val) != JS_CLASS_WIFI_CSI_FRAME)
        return JS_ThrowTypeError(ctx, "WiFiCsiFrame.source requires its Frame");
    if (!wifi_csi_capture_source_options(ctx, argc, argv)) return JS_EXCEPTION;
    esp32_mquickjs_wifi_csi_event_t event;
    if (wifi_csi_frame_from_value(ctx, *this_val, "WiFiCsiFrame.source()", NULL, &event) == NULL)
        return JS_EXCEPTION;
    return wifi_csi_new_wire_source(ctx, &event, 1U);
}

JSValue js_wifi_csi_frame_close(JSContext *ctx, JSValue *this_val,
                                int argc, JSValue *argv)
{
    wifi_csi_frame_ref_t *ref;
    wifi_csi_lease_ref_t lease;

    (void)argv;
    if (argc != 0 || this_val == NULL ||
        JS_GetClassID(ctx, *this_val) != JS_CLASS_WIFI_CSI_FRAME) {
        return JS_ThrowTypeError(
            ctx, "WiFiCsiFrame.close() expects no arguments");
    }
    ref = JS_GetOpaque(ctx, *this_val);
    if (ref == NULL) return JS_TRUE;
    memset(&lease, 0, sizeof(lease));
    lease.event.session_generation = ref->session_generation;
    lease.event.slot_index = ref->slot_index;
    lease.event.slot_generation = ref->slot_generation;
    ref->closed = true;
    wifi_csi_lease_request_close(&lease);
    JS_SetOpaque(ctx, *this_val, NULL);
    esp32_mquickjs_memory_payload_free(ref);
    return JS_TRUE;
}

