99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_csi/esp32_mquickjs_wifi_csi.c
JSValue js_wifi_csi_batch_constructor(JSContext *ctx, JSValue *this_val,
                                      int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(ctx,
        "WiFiCsiBatch cannot be constructed directly");
}

static void wifi_csi_batch_release_owner(wifi_csi_batch_ref_t *batch)
{
    uint16_t index;

    if (batch == NULL || batch->closed) return;
    batch->closed = true;
    for (index = 0; index < batch->frame_count; ++index) {
        wifi_csi_lease_ref_t lease = {.event = batch->events[index]};

        wifi_csi_lease_request_close(&lease);
    }
}

void js_wifi_csi_batch_finalizer(JSContext *ctx, void *opaque)
{
    wifi_csi_batch_ref_t *batch = opaque;

    (void)ctx;
    wifi_csi_batch_release_owner(batch);
    esp32_mquickjs_memory_payload_free(batch);
}

static bool wifi_csi_batch_index(JSContext *ctx,
                                 wifi_csi_batch_ref_t *batch,
                                 int argc, JSValue *argv,
                                 uint32_t *index)
{
    if (argc != 1 || !esp32_mquickjs_value_to_bounded_u32(
            ctx, argv[0], 0U,
            batch->frame_count > 0U ? batch->frame_count - 1U : 0U,
            index)) {
        JS_ThrowRangeError(ctx, "batch index is out of range");
        return false;
    }
    return true;
}

JSValue js_wifi_csi_batch_info(JSContext *ctx, JSValue *this_val,
                               int argc, JSValue *argv)
{
    wifi_csi_batch_ref_t *batch;
    esp32_mquickjs_wifi_csi_slot_t *slot;
    uint32_t index;

    if (this_val == NULL ||
        (batch = wifi_csi_batch_from_value(
            ctx, *this_val, "WiFiCsiBatch.info()")) == NULL ||
        !wifi_csi_batch_index(ctx, batch, argc, argv, &index)) {
        return JS_EXCEPTION;
    }
    slot = wifi_csi_resolve_event(&batch->events[index]);
    if (slot == NULL) {
        return JS_ThrowReferenceError(
            ctx, "WIFI_CSI_STALE_FRAME: batch frame is stale");
    }
    return wifi_csi_frame_info_to_js(ctx, slot);
}

static JSValue wifi_csi_batch_bytes(JSContext *ctx, JSValue *this_val,
                                  int argc, JSValue *argv, bool packet)
{
    wifi_csi_batch_ref_t *batch;
    esp32_mquickjs_wifi_csi_slot_t *slot;
    wifi_csi_lease_ref_t *lease;
    uint32_t index;

    if (this_val == NULL ||
        (batch = wifi_csi_batch_from_value(
            ctx, *this_val, "WiFiCsiBatch.samples()")) == NULL ||
        !wifi_csi_batch_index(ctx, batch, argc, argv, &index)) {
        return JS_EXCEPTION;
    }
    slot = wifi_csi_resolve_event(&batch->events[index]);
    if (slot == NULL) {
        return JS_ThrowReferenceError(
            ctx, "WIFI_CSI_STALE_FRAME: batch frame is stale");
    }
    if (packet && (slot->packet == NULL || slot->packet->length == 0)) return JS_NULL;
    lease = wifi_csi_retain_event(&batch->events[index]);
    if (lease == NULL) return JS_ThrowOutOfMemory(ctx);
    return esp32_mquickjs_new_wireless_retained_byte_view("wifi.csi",
        ctx, packet ? slot->packet->bytes : slot->payload,
        packet ? slot->packet->length : slot->length,
        wifi_csi_byte_view_release, lease);
}

JSValue js_wifi_csi_batch_samples(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{ return wifi_csi_batch_bytes(ctx, this_val, argc, argv, false); }
JSValue js_wifi_csi_batch_packet_bytes(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{ return wifi_csi_batch_bytes(ctx, this_val, argc, argv, true); }

JSValue js_wifi_csi_batch_source(JSContext *ctx, JSValue *this_val,
                                 int argc, JSValue *argv)
{
    if (this_val == NULL || JS_GetClassID(ctx, *this_val) != JS_CLASS_WIFI_CSI_BATCH)
        return JS_ThrowTypeError(ctx, "WiFiCsiBatch.source requires its Batch");
    if (!wifi_csi_capture_source_options(ctx, argc, argv)) return JS_EXCEPTION;
    /* A format getter can close the Batch: never keep its adapter across JS. */
    wifi_csi_batch_ref_t *batch = wifi_csi_batch_from_value(ctx, *this_val, "WiFiCsiBatch.source()");
    if (batch == NULL) return JS_EXCEPTION;
    return wifi_csi_new_wire_source(ctx, batch->events, batch->frame_count);
}

JSValue js_wifi_csi_batch_close(JSContext *ctx, JSValue *this_val,
                                int argc, JSValue *argv)
{
    wifi_csi_batch_ref_t *batch;

    (void)argv;
    if (argc != 0 || this_val == NULL ||
        JS_GetClassID(ctx, *this_val) != JS_CLASS_WIFI_CSI_BATCH) {
        return JS_ThrowTypeError(
            ctx, "WiFiCsiBatch.close() expects no arguments");
    }
    batch = JS_GetOpaque(ctx, *this_val);
    if (batch == NULL) return JS_TRUE;
    wifi_csi_batch_release_owner(batch);
    JS_SetOpaque(ctx, *this_val, NULL);
    esp32_mquickjs_memory_payload_free(batch);
    return JS_TRUE;
}

JSValue js_wifi_csi_session_receive_batch(JSContext *ctx,
                                          JSValue *this_val,
                                          int argc,
                                          JSValue *argv)
{
    static const char *const allowed[] = {
        "maximumFrames", "minimumFrames", "timeoutMs", "maximumLatencyMs",
    };
    wifi_csi_session_t *session;
    wifi_csi_batch_ref_t *batch = NULL;
    wifi_csi_frame_ref_t *frame_ref;
    JSGCRef first_ref, object_ref, options_ref;
    JSValue *first = JS_PushGCRef(ctx, &first_ref);
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *options = JS_PushGCRef(ctx, &options_ref);
    uint32_t maximum_frames = CONFIG_ESP32_MQUICKJS_WIFI_CSI_MAX_BATCH_FRAMES;
    uint32_t minimum_frames = 1U;
    uint32_t timeout_ms = 0U;
    uint32_t maximum_latency_ms = 0U;
    bool timeout_set = false;
    int64_t latency_deadline_us = 0;

    *first = JS_UNDEFINED;
    *object = JS_UNDEFINED;
    *options = JS_UNDEFINED;
    if (this_val == NULL ||
        (session = wifi_csi_session_from_value(
            ctx, *this_val, false)) == NULL) goto fail;
    if (maximum_frames > session->options.queue_capacity)
        maximum_frames = session->options.queue_capacity;
    if (argc > 1) {
        JS_ThrowTypeError(
            ctx, "WiFiCsiSession.receiveBatch(options?) expects at most one argument");
        goto fail;
    }
    if (argc == 1 && !JS_IsUndefined(argv[0])) {
        JSValue property;

        *options = argv[0];
        if (!esp32_mquickjs_validate_plain_options(
                ctx, *options, "WiFiCsiSession.receiveBatch()",
                allowed, sizeof(allowed) / sizeof(allowed[0]))) goto fail;
        property = JS_GetPropertyStr(ctx, *options, "maximumFrames");
        if (JS_IsException(property)) goto fail;
        if (!JS_IsUndefined(property) &&
            !esp32_mquickjs_value_to_bounded_u32(
                ctx, property, 1U,
                CONFIG_ESP32_MQUICKJS_WIFI_CSI_MAX_BATCH_FRAMES,
                &maximum_frames)) {
            JS_ThrowRangeError(ctx,
                "maximumFrames exceeds this Build Context");
            goto fail;
        }
        property = JS_GetPropertyStr(ctx, *options, "minimumFrames");
        if (JS_IsException(property)) goto fail;
        if (!JS_IsUndefined(property) &&
            !esp32_mquickjs_value_to_bounded_u32(
                ctx, property, 1U,
                CONFIG_ESP32_MQUICKJS_WIFI_CSI_MAX_BATCH_FRAMES,
                &minimum_frames)) {
            JS_ThrowRangeError(ctx,
                "minimumFrames exceeds this Build Context");
            goto fail;
        }
        if (minimum_frames > maximum_frames) {
            JS_ThrowRangeError(
                ctx, "minimumFrames must not exceed maximumFrames");
            goto fail;
        }
        property = JS_GetPropertyStr(ctx, *options, "timeoutMs");
        if (JS_IsException(property)) goto fail;
        if (!JS_IsUndefined(property)) {
            if (!esp32_mquickjs_value_to_bounded_u32(
                    ctx, property, 0U, INT32_MAX, &timeout_ms)) {
                JS_ThrowRangeError(
                    ctx, "timeoutMs must be an integer from 0 to INT32_MAX");
                goto fail;
            }
            timeout_set = true;
        }
        property = JS_GetPropertyStr(ctx, *options, "maximumLatencyMs");
        if (JS_IsException(property)) goto fail;
        if (!JS_IsUndefined(property) &&
            !esp32_mquickjs_value_to_bounded_u32(
                ctx, property, 0U, INT32_MAX, &maximum_latency_ms)) {
            JS_ThrowRangeError(ctx,
                "maximumLatencyMs must be an integer from 0 to INT32_MAX");
            goto fail;
        }
    }
    if (maximum_frames > session->options.queue_capacity ||
        !esp32_mquickjs_wifi_csi_batch_options_valid(
            maximum_frames, minimum_frames, timeout_ms,
            maximum_latency_ms,
            CONFIG_ESP32_MQUICKJS_WIFI_CSI_MAX_BATCH_FRAMES)) {
        JS_ThrowRangeError(ctx, "invalid receiveBatch aggregation options");
        goto fail;
    }
    if (timeout_set) {
        JSValue receive_argument = JS_NewUint32(ctx, timeout_ms);

        *first = js_wifi_csi_session_receive(
            ctx, this_val, 1, &receive_argument);
    } else {
        *first = js_wifi_csi_session_receive(ctx, this_val, 0, NULL);
    }
    if (JS_IsException(*first)) goto fail;
    if (JS_IsNull(*first)) {
        JS_PopGCRef(ctx, &options_ref);
        JS_PopGCRef(ctx, &object_ref);
        JS_PopGCRef(ctx, &first_ref);
        return JS_NULL;
    }
    if (JS_GetClassID(ctx, *first) != JS_CLASS_WIFI_CSI_FRAME ||
        (frame_ref = JS_GetOpaque(ctx, *first)) == NULL) {
        JS_ThrowInternalError(ctx,
            "Wi-Fi CSI receive returned an invalid frame");
        goto fail;
    }
    batch = esp32_mquickjs_memory_wireless_calloc("wifi.csi", 1, sizeof(*batch) +
            ((size_t)maximum_frames * sizeof(batch->events[0])), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (batch == NULL) {
        JS_ThrowOutOfMemory(ctx);
        goto fail;
    }
    batch->frame_count = 1U;
    batch->events[0].session_generation = frame_ref->session_generation;
    batch->events[0].slot_index = frame_ref->slot_index;
    batch->events[0].slot_generation = frame_ref->slot_generation;
    frame_ref->closed = true;
    JS_SetOpaque(ctx, *first, NULL);
    esp32_mquickjs_memory_payload_free(frame_ref);
    atomic_fetch_sub_explicit(
        &session->resources->counters.delivered_frames, 1U,
        memory_order_relaxed);
    *first = JS_UNDEFINED;
    latency_deadline_us = esp_timer_get_time() +
        ((int64_t)maximum_latency_ms * 1000LL);
    for (;;) {
        while (batch->frame_count < maximum_frames) {
            esp32_mquickjs_wifi_csi_event_t event;

            if (!esp32_mquickjs_event_queue_try_receive(
                    session->event_queue, &event)) break;
            if (wifi_csi_update_event(&event, WIFI_CSI_EVENT_TAKE)) {
                batch->events[batch->frame_count++] = event;
            }
        }
        if (esp32_mquickjs_wifi_csi_batch_should_return(
                batch->frame_count, minimum_frames, maximum_frames,
                maximum_latency_ms,
                esp_timer_get_time() >= latency_deadline_us)) break;
        {
            int64_t remaining_us = latency_deadline_us - esp_timer_get_time();
            uint32_t remaining_ms;
            JSValue receive_argument;

