99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_csi/esp32_mquickjs_wifi_csi.c
            if (remaining_us <= 0) break;
            remaining_ms = (uint32_t)((remaining_us + 999LL) / 1000LL);
            receive_argument = JS_NewUint32(ctx, remaining_ms);
            *first = js_wifi_csi_session_receive(
                ctx, this_val, 1, &receive_argument);
            if (JS_IsException(*first)) goto fail_batch;
            if (JS_IsNull(*first)) {
                *first = JS_UNDEFINED;
                break;
            }
            if (JS_GetClassID(ctx, *first) != JS_CLASS_WIFI_CSI_FRAME ||
                (frame_ref = JS_GetOpaque(ctx, *first)) == NULL) {
                JS_ThrowInternalError(ctx,
                    "Wi-Fi CSI receive returned an invalid frame");
                goto fail_batch;
            }
            batch->events[batch->frame_count].session_generation =
                frame_ref->session_generation;
            batch->events[batch->frame_count].slot_index =
                frame_ref->slot_index;
            batch->events[batch->frame_count].slot_generation =
                frame_ref->slot_generation;
            batch->frame_count += 1U;
            frame_ref->closed = true;
            JS_SetOpaque(ctx, *first, NULL);
            esp32_mquickjs_memory_payload_free(frame_ref);
            atomic_fetch_sub_explicit(
                &session->resources->counters.delivered_frames, 1U,
                memory_order_relaxed);
            *first = JS_UNDEFINED;
        }
    }
    *object = JS_NewObjectClassUser(ctx, JS_CLASS_WIFI_CSI_BATCH);
    if (JS_IsException(*object)) goto fail_batch;
    JS_SetOpaque(ctx, *object, batch);
    if (!esp32_mquickjs_set_property_ref(
            ctx, object, "frameCount",
            JS_NewUint32(ctx, batch->frame_count))) {
        JS_SetOpaque(ctx, *object, NULL);
        goto fail_batch;
    }
    (void)wifi_csi_update_event(&batch->events[0], WIFI_CSI_EVENT_BATCH_DELIVERED);
    *options = JS_UNDEFINED;
    JS_PopGCRef(ctx, &options_ref);
    JSValue return_value = JS_PopGCRef(ctx, &object_ref);
    JS_PopGCRef(ctx, &first_ref);
    return return_value;

fail_batch:
    wifi_csi_batch_release_owner(batch);
    esp32_mquickjs_memory_payload_free(batch);
    batch = NULL;
fail:
    if (batch != NULL) {
        wifi_csi_batch_release_owner(batch);
        esp32_mquickjs_memory_payload_free(batch);
    }
    if (!JS_IsUndefined(*first) &&
        JS_GetClassID(ctx, *first) == JS_CLASS_WIFI_CSI_FRAME) {
        (void)js_wifi_csi_frame_close(ctx, first, 0, NULL);
    }
    JS_PopGCRef(ctx, &options_ref);
    JS_PopGCRef(ctx, &object_ref);
    JS_PopGCRef(ctx, &first_ref);
    return JS_EXCEPTION;
}

bool esp32_mquickjs_init_wifi_csi_runtime(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime)
{
    JSGCRef session_ref, method_ref;
    JSValue *session = JS_PushGCRef(ctx, &session_ref);
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    bool result;

    if (ctx == NULL || runtime == NULL ||
        atomic_load_explicit(&s_wifi_csi.lifecycle,
                             memory_order_acquire) != WIFI_CSI_CLOSED ||
        atomic_load_explicit(&s_wifi_csi.cleanup_scheduled,
                             memory_order_acquire) ||
        wifi_csi_pool_retirement_pending()) {
        JS_PopGCRef(ctx, &method_ref);
        JS_PopGCRef(ctx, &session_ref);
        return false;
    }
    *session = JS_NewObjectClassUser(ctx, JS_CLASS_WIFI_CSI_SESSION);
    *method = JS_IsException(*session)
        ? JS_EXCEPTION
        : JS_GetPropertyStr(ctx, *session, "receive");
    result = !JS_IsException(*method) &&
        esp32_mquickjs_event_queue_register_receive_alias(
            ctx, runtime, *method);
    if (!result && !JS_HasException(ctx)) {
        JS_ThrowInternalError(ctx,
            "failed to register Wi-Fi CSI receive Future driver");
    }
    JS_PopGCRef(ctx, &method_ref);
    JS_PopGCRef(ctx, &session_ref);
    return result;
}

void esp32_mquickjs_deinit_wifi_csi_runtime(JSContext *ctx)
{
    (void)ctx;
    if (!wifi_csi_close_native(&s_wifi_csi)) {
        ESP_LOGE(TAG, "Wi-Fi CSI runtime cleanup remains pending");
    }
}

#endif
